Deadline039/STM32F4xx-HAL-CSP/Config/CSP_Config.h
/**
 * @file    CSP_Config.h
 * @author  Deadline039
 * @brief   The CSP configuration of STM32F4xx.
 * @version 1.0
 * @date    2024-10-22
 * @note    Reference the CMSIS RTE Devices.
 */

//-------- <<< Use Configuration Wizard in Context Menu >>> --------------------

#ifndef __CSP_CONFIG_H
#define __CSP_CONFIG_H

// <e> USART1 (Universal synchronous asynchronous receiver transmitter)
#define USART1_ENABLE 1

//   <o> USART1_TX Pin <0=>Not Used <1=>PA9 <2=>PA15 <3=>PB6
#define USART1_TX_ID  1
#if (USART1_TX_ID == 0)
#define USART1_TX 0
#elif (USART1_TX_ID == 1)
#define USART1_TX      1
#define USART1_TX_PORT A
#define USART1_TX_PIN  GPIO_PIN_9
#elif (USART1_TX_ID == 2)
#define USART1_TX      1
#define USART1_TX_PORT A
#define USART1_TX_PIN  GPIO_PIN_15
#elif (USART1_TX_ID == 3)
#define USART1_TX      1
#define USART1_TX_PORT B
#define USART1_TX_PIN  GPIO_PIN_6
#else
#error "Invalid USART1_TX Pin Configuration!"
#endif

//   <o> USART1_RX Pin <0=>Not Used <1=>PA10 <2=>PB3 <3=>PB7
#define USART1_RX_ID 1
#if (USART1_RX_ID == 0)
#define USART1_RX 0
#elif (USART1_RX_ID == 1)
#define USART1_RX      1
#define USART1_RX_PORT A
#define USART1_RX_PIN  GPIO_PIN_10
#elif (USART1_RX_ID == 2)
#define USART1_RX      1
#define USART1_RX_PORT B
#define USART1_RX_PIN  GPIO_PIN_3
#elif (USART1_RX_ID == 3)
#define USART1_RX      1
#define USART1_RX_PORT B
#define USART1_RX_PIN  GPIO_PIN_7
#else
#error "Invalid USART1_RX Pin Configuration!"
#endif

//   <o> USART1_CTS Pin <0=>Not Used <1=>PA11
#define USART1_CTS_ID 0
#if (USART1_CTS_ID == 0)
#define USART1_CTS 0
#elif (USART1_CTS_ID == 1)
#define USART1_CTS      1
#define USART1_CTS_PORT A
#define USART1_CTS_PIN  GPIO_PIN_11
#else
#error "Invalid USART1_CTS Pin Configuration!"
#endif

//   <o> USART1_RTS Pin <0=>Not Used <1=>PA12
#define USART1_RTS_ID 0
#if (USART1_RTS_ID == 0)
#define USART1_RTS 0
#elif (USART1_RTS_ID == 1)
#define USART1_RTS      1
#define USART1_RTS_PORT A
#define USART1_RTS_PIN  GPIO_PIN_12
#else
#error "Invalid USART1_RTS Pin Configuration!"
#endif

//   <o> USART1 Interrupt Priority <0-15>
//   <i> The Interrupt Priority of USART1
#define USART1_IT_PRIORITY        2
//   <o> USART1 Interrupt SubPriority <0-15>
//   <i> The Interrupt SubPriority of USART1
#define USART1_IT_SUB             3

//   <e> DMA Rx
//     <o1> Number <2=>2
//     <i>  Selects DMA Number (only DMA2 can be used)
//     <o2> Stream <2=>2 <5=>5
//     <i>  Selects DMA Stream (only Stream 2 or 5 can be used)
//     <o3> Channel <4=>4
//     <i>  Selects DMA Channel (only Channel 4 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//     <o5> DMA Rx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Rx
//     <o6> DMA Rx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Rx
//     <o7> The size of Receive buf [byte]
//     <i>  Using FIFO and Buf to implement high reliable USART Receive
//     <o8> The size of Receive FIFO [byte] (Must be power of 2)
//     <i>  Using FIFO and Buf to implement high reliable USART Receive
//   </e>
#define USART1_RX_DMA             0
#define USART1_RX_DMA_NUMBER      2
#define USART1_RX_DMA_STREAM      2
#define USART1_RX_DMA_CHANNEL     4
#define USART1_RX_DMA_PRIORITY    1
#define USART1_RX_DMA_IT_PRIORITY 2
#define USART1_RX_DMA_IT_SUB      2
#define USART1_RX_DMA_BUF_SIZE    256
#define USART1_RX_DMA_FIFO_SIZE   256

//   <e> DMA Tx
//     <o1> Number <2=>2
//     <i>  Selects DMA Number (only DMA2 can be used)
//     <o2> Stream <7=>7
//     <i>  Selects DMA Stream (only Stream 7 can be used)
//     <o3> Channel <4=>4
//     <i>  Selects DMA Channel (only Channel 4 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//     <o5> DMA Tx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Tx
//     <o6> DMA Tx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Tx
//     <o7> The size of Send buf [byte]
//     <i>  Write data to Send buf, and sending with thread safety
//   </e>
#define USART1_TX_DMA             0
#define USART1_TX_DMA_NUMBER      2
#define USART1_TX_DMA_STREAM      7
#define USART1_TX_DMA_CHANNEL     4
#define USART1_TX_DMA_PRIORITY    0
#define USART1_TX_DMA_IT_PRIORITY 1
#define USART1_TX_DMA_IT_SUB      4
#define USART1_TX_DMA_BUF_SIZE    256

// </e>

// <e> USART2 (Universal synchronous asynchronous receiver transmitter)
#define USART2_ENABLE             0

//   <o> USART2_TX Pin <0=>Not Used <1=>PA2 <2=>PD5
#define USART2_TX_ID              0
#if (USART2_TX_ID == 0)
#define USART2_TX 0
#elif (USART2_TX_ID == 1)
#define USART2_TX      1
#define USART2_TX_PORT A
#define USART2_TX_PIN  GPIO_PIN_2
#elif (USART2_TX_ID == 2)
#define USART2_TX      1
#define USART2_TX_PORT D
#define USART2_TX_PIN  GPIO_PIN_5
#else
#error "Invalid USART2_TX Pin Configuration!"
#endif

//   <o> USART2_RX Pin <0=>Not Used <1=>PA3 <2=>PD6
#define USART2_RX_ID 0
#if (USART2_RX_ID == 0)
#define USART2_RX 0
#elif (USART2_RX_ID == 1)
#define USART2_RX      1
#define USART2_RX_PORT A
#define USART2_RX_PIN  GPIO_PIN_3
#elif (USART2_RX_ID == 2)
#define USART2_RX      1
#define USART2_RX_PORT D
#define USART2_RX_PIN  GPIO_PIN_6
#else
#error "Invalid USART2_RX Pin Configuration!"
#endif

//   <o> USART2_CTS Pin <0=>Not Used <1=>PA0 <2=>PD3
#define USART2_CTS_ID 0
#if (USART2_CTS_ID == 0)
#define USART2_CTS 0
#elif (USART2_CTS_ID == 1)
#define USART2_CTS      1
#define USART2_CTS_PORT A
#define USART2_CTS_PIN  GPIO_PIN_0
#elif (USART2_CTS_ID == 2)
#define USART2_CTS      1
#define USART2_CTS_PORT D
#define USART2_CTS_PIN  GPIO_PIN_3
#else
#error "Invalid USART2_CTS Pin Configuration!"
#endif

//   <o> USART2_RTS Pin <0=>Not Used <1=>PA1 <2=>PD4
#define USART2_RTS_ID 0
#if (USART2_RTS_ID == 0)
#define USART2_RTS 0
#elif (USART2_RTS_ID == 1)
#define USART2_RTS      1
#define USART2_RTS_PORT A
#define USART2_RTS_PIN  GPIO_PIN_1
#elif (USART2_RTS_ID == 2)
#define USART2_RTS      1
#define USART2_RTS_PORT D
#define USART2_RTS_PIN  GPIO_PIN_4
#else
#error "Invalid USART2_RTS Pin Configuration!"
#endif

