Deadline039/STM32F4xx-HAL-CSP/Config/CSP_Config.h
//   <o> USART2 Interrupt Priority <0-15>
//   <i> The Interrupt Priority of USART2
#define USART2_IT_PRIORITY        2
//   <o> USART2 Interrupt SubPriority <0-15>
//   <i> The Interrupt SubPriority of USART2
#define USART2_IT_SUB             3

//   <e> DMA Rx
//     <o1> Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <5=>5 <7=>7
//     <i>  Selects DMA Stream (only Stream 5 or 7 can be used)
//     <o3> Channel <4=>4 <6=>6
//     <i>  Selects DMA Channel (only Channel 4 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//     <o5> DMA Rx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Rx
//     <o6> DMA Rx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Rx
//     <o7> The size of Receive buf [byte]
//     <i>  Using FIFO and Buf to implement high reliable USART Receive
//     <o8> The size of Receive FIFO [byte] (Must be power of 2)
//     <i>  Using FIFO and Buf to implement high reliable USART Receive
//   </e>
#define USART2_RX_DMA             0
#define USART2_RX_DMA_NUMBER      1
#define USART2_RX_DMA_STREAM      5
#define USART2_RX_DMA_CHANNEL     4
#define USART2_RX_DMA_PRIORITY    0
#define USART2_RX_DMA_IT_PRIORITY 2
#define USART2_RX_DMA_IT_SUB      2
#define USART2_RX_DMA_BUF_SIZE    256
#define USART2_RX_DMA_FIFO_SIZE   256

//   <e> DMA Tx
//     <o1> Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <6=>6
//     <i>  Selects DMA Stream (only Stream 6 can be used)
//     <o3> Channel <4=>4
//     <i>  Selects DMA Channel (only Channel 4 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//     <o5> DMA Tx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Tx
//     <o6> DMA Tx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Tx
//     <o7> The size of Send buf [byte]
//     <i>  Write data to Send buf, and sending with thread safety
//   </e>
#define USART2_TX_DMA             0
#define USART2_TX_DMA_NUMBER      1
#define USART2_TX_DMA_STREAM      6
#define USART2_TX_DMA_CHANNEL     4
#define USART2_TX_DMA_PRIORITY    0
#define USART2_TX_DMA_IT_PRIORITY 1
#define USART2_TX_DMA_IT_SUB      4
#define USART2_TX_DMA_BUF_SIZE    256

// </e>

// <e> USART3 (Universal synchronous asynchronous receiver transmitter)
#define USART3_ENABLE             0

//   <o> USART3_TX Pin <0=>Not Used <1=>PB10 <2=>PC10 <3=>PD8
#define USART3_TX_ID              0
#if (USART3_TX_ID == 0)
#define USART3_TX 0
#elif (USART3_TX_ID == 1)
#define USART3_TX      1
#define USART3_TX_PORT B
#define USART3_TX_PIN  GPIO_PIN_10
#elif (USART3_TX_ID == 2)
#define USART3_TX      1
#define USART3_TX_PORT C
#define USART3_TX_PIN  GPIO_PIN_10
#elif (USART3_TX_ID == 3)
#define USART3_TX      1
#define USART3_TX_PORT D
#define USART3_TX_PIN  GPIO_PIN_8
#else
#error "Invalid USART3_TX Pin Configuration!"
#endif

//   <o> USART3_RX Pin <0=>Not Used <1=>PB11 <2=>PC11 <3=>PD9 <4=>PC5
#define USART3_RX_ID 0
#if (USART3_RX_ID == 0)
#define USART3_RX 0
#elif (USART3_RX_ID == 1)
#define USART3_RX      1
#define USART3_RX_PORT B
#define USART3_RX_PIN  GPIO_PIN_11
#elif (USART3_RX_ID == 2)
#define USART3_RX      1
#define USART3_RX_PORT C
#define USART3_RX_PIN  GPIO_PIN_11
#elif (USART3_RX_ID == 3)
#define USART3_RX      1
#define USART3_RX_PORT D
#define USART3_RX_PIN  GPIO_PIN_9
#elif (USART3_RX_ID == 4)
#define USART3_RX      1
#define USART3_RX_PORT C
#define USART3_RX_PIN  GPIO_PIN_5
#else
#error "Invalid USART3_RX Pin Configuration!"
#endif

//   <o> USART3_CTS Pin <0=>Not Used <1=>PB13 <2=>PD11
#define USART3_CTS_ID 0
#if (USART3_CTS_ID == 0)
#define USART3_CTS 0
#elif (USART3_CTS_ID == 1)
#define USART3_CTS      1
#define USART3_CTS_PORT B
#define USART3_CTS_PIN  GPIO_PIN_13
#elif (USART3_CTS_ID == 2)
#define USART3_CTS      1
#define USART3_CTS_PORT D
#define USART3_CTS_PIN  GPIO_PIN_11
#else
#error "Invalid USART3_CTS Pin Configuration!"
#endif

//   <o> USART3_RTS Pin <0=>Not Used <1=>PB14 <2=>PD12
#define USART3_RTS_ID 0
#if (USART3_RTS_ID == 0)
#define USART3_RTS 0
#elif (USART3_RTS_ID == 1)
#define USART3_RTS      1
#define USART3_RTS_PORT B
#define USART3_RTS_PIN  GPIO_PIN_14
#elif (USART3_RTS_ID == 2)
#define USART3_RTS      1
#define USART3_RTS_PORT D
#define USART3_RTS_PIN  GPIO_PIN_12
#else
#error "Invalid USART3_RTS Pin Configuration!"
#endif

//   <o> USART3 Interrupt Priority <0-15>
//   <i> The Interrupt Priority of USART3
#define USART3_IT_PRIORITY        2
//   <o> USART3 Interrupt SubPriority <0-15>
//   <i> The Interrupt SubPriority of USART3
#define USART3_IT_SUB             3

//   <e> DMA Rx
//     <o1> Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <1=>1 <4=>4
//     <i>  Selects DMA Stream (only Stream 1 or 4 can be used)
//     <o3> Channel <4=>4 <7=>7
//     <i>  Selects DMA Channel (only Channel 4 or 7 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//     <o5> DMA Rx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Rx
//     <o6> DMA Rx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Rx
//     <o7> The size of Receive buf [byte]
//     <i>  Using FIFO and Buf to implement high reliable USART Receive
//     <o8> The size of Receive FIFO [byte] (Must be power of 2)
//     <i>  Using FIFO and Buf to implement high reliable USART Receive
//   </e>
#define USART3_RX_DMA             0
#define USART3_RX_DMA_NUMBER      1
#define USART3_RX_DMA_STREAM      1
#define USART3_RX_DMA_CHANNEL     4
#define USART3_RX_DMA_PRIORITY    0
#define USART3_RX_DMA_IT_PRIORITY 2
#define USART3_RX_DMA_IT_SUB      2
#define USART3_RX_DMA_BUF_SIZE    256
#define USART3_RX_DMA_FIFO_SIZE   256

//   <e> DMA Tx
//     <o1> Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <3=>3 <4=>4
//     <i>  Selects DMA Stream (only Stream 3 or 4 can be used)
//     <o3> Channel <4=>4 <7=>7
//     <i>  Selects DMA Channel (only Channel 4 or 7 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//     <o5> DMA Tx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Tx
//     <o6> DMA Tx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Tx
//     <o7> The size of Send buf [byte]
//     <i>  Write data to Send buf, and sending with thread safety
//   </e>
#define USART3_TX_DMA             0
#define USART3_TX_DMA_NUMBER      1
#define USART3_TX_DMA_STREAM      3
#define USART3_TX_DMA_CHANNEL     4
#define USART3_TX_DMA_PRIORITY    0
#define USART3_TX_DMA_IT_PRIORITY 1
#define USART3_TX_DMA_IT_SUB      4
#define USART3_TX_DMA_BUF_SIZE    256

// </e>

// <e> UART4 (Universal asynchronous receiver transmitter)
#define UART4_ENABLE              0

//   <o> UART4_TX Pin <0=>Not Used <1=>PA0 <2=>PC10 <3=>PD10 <4=>PA12 <5=>PD1
#define UART4_TX_ID               0
#if (UART4_TX_ID == 0)
#define UART4_TX 0
#elif (UART4_TX_ID == 1)
#define UART4_TX      1
#define UART4_TX_PORT A
#define UART4_TX_PIN  GPIO_PIN_0
#elif (UART4_TX_ID == 2)
#define UART4_TX      1
#define UART4_TX_PORT C
#define UART4_TX_PIN  GPIO_PIN_10
#elif (UART4_TX_ID == 3)
#define UART4_TX      1
#define UART4_TX_PORT D
#define UART4_TX_PIN  GPIO_PIN_10
#elif (UART4_TX_ID == 4)
#define UART4_TX      1
#define UART4_TX_PORT A
#define UART4_TX_PIN  GPIO_PIN_12
#elif (UART4_TX_ID == 5)
#define UART4_TX      1
#define UART4_TX_PORT D
#define UART4_TX_PIN  GPIO_PIN_1
#else
#error "Invalid UART4_TX Pin Configuration!"
#endif

//   <o> UART4_RX Pin <0=>Not Used <1=>PA1 <2=>PC11 <3=>PA11 <4=>PD0
#define UART4_RX_ID 0
#if (UART4_RX_ID == 0)
#define UART4_RX 0
#elif (UART4_RX_ID == 1)
#define UART4_RX      1
#define UART4_RX_PORT A
#define UART4_RX_PIN  GPIO_PIN_1
#elif (UART4_RX_ID == 2)
#define UART4_RX      1
#define UART4_RX_PORT C
#define UART4_RX_PIN  GPIO_PIN_11
#elif (UART4_RX_ID == 3)
#define UART4_RX      1
#define UART4_RX_PORT A
#define UART4_RX_PIN  GPIO_PIN_11
#elif (UART4_RX_ID == 4)
#define UART4_RX      1
#define UART4_RX_PORT D
#define UART4_RX_PIN  GPIO_PIN_0
#else
#error "Invalid UART4_RX Pin Configuration!"
#endif

//   <o> UART4 Interrupt Priority <0-15>
//   <i> The Interrupt Priority of UART4
#define UART4_IT_PRIORITY        2
//   <o> UART4 Interrupt SubPriority <0-15>
//   <i> The Interrupt SubPriority of UART4
#define UART4_IT_SUB             3

