Deadline039/STM32F4xx-HAL-CSP/Config/CSP_Config.h
//   <e> DMA Rx
//     <o1> Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <2=>2
//     <i>  Selects DMA Stream (only Stream 2 can be used)
//     <o3> Channel <4=>4
//     <i>  Selects DMA Channel (only Channel 4 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//     <o5> DMA Rx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Rx
//     <o6> DMA Rx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Rx
//     <o7> The size of Receive buf [byte]
//     <i>  Using FIFO and Buf to implement high reliable USART Receive
//     <o8> The size of Receive FIFO [byte] (Must be power of 2)
//     <i>  Using FIFO and Buf to implement high reliable USART Receive
//   </e>
#define UART4_RX_DMA             0
#define UART4_RX_DMA_NUMBER      1
#define UART4_RX_DMA_STREAM      2
#define UART4_RX_DMA_CHANNEL     4
#define UART4_RX_DMA_PRIORITY    0
#define UART4_RX_DMA_IT_PRIORITY 2
#define UART4_RX_DMA_IT_SUB      2
#define UART4_RX_DMA_BUF_SIZE    256
#define UART4_RX_DMA_FIFO_SIZE   256

//   <e> DMA Tx
//     <o1> Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <4=>4
//     <i>  Selects DMA Stream (only Stream 4 can be used)
//     <o3> Channel <4=>4
//     <i>  Selects DMA Channel (only Channel 4 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//     <o5> DMA Tx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Tx
//     <o6> DMA Tx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Tx
//     <o7> The size of Send buf [byte]
//     <i>  Write data to Send buf, and sending with thread safety
//   </e>
#define UART4_TX_DMA             0
#define UART4_TX_DMA_NUMBER      1
#define UART4_TX_DMA_STREAM      4
#define UART4_TX_DMA_CHANNEL     4
#define UART4_TX_DMA_PRIORITY    0
#define UART4_TX_DMA_IT_PRIORITY 1
#define UART4_TX_DMA_IT_SUB      4
#define UART4_TX_DMA_BUF_SIZE    256

// </e>

// <e> UART5 (Universal asynchronous receiver transmitter)
#define UART5_ENABLE             0

//   <o> UART5_TX Pin <0=>Not Used <1=>PC12 <2=>PB6 <3=>PB9 <4=>PB13
#define UART5_TX_ID              0
#if (UART5_TX_ID == 0)
#define UART5_TX 0
#elif (UART5_TX_ID == 1)
#define UART5_TX      1
#define UART5_TX_PORT C
#define UART5_TX_PIN  GPIO_PIN_12
#elif (UART5_TX_ID == 2)
#define UART5_TX      1
#define UART5_TX_PORT B
#define UART5_TX_PIN  GPIO_PIN_6
#elif (UART5_TX_ID == 3)
#define UART5_TX      1
#define UART5_TX_PORT B
#define UART5_TX_PIN  GPIO_PIN_9
#elif (UART5_TX_ID == 4)
#define UART5_TX      1
#define UART5_TX_PORT B
#define UART5_TX_PIN  GPIO_PIN_13
#else
#error "Invalid UART5_TX Pin Configuration!"
#endif

//   <o> UART5_RX Pin <0=>Not Used <1=>PD2 <2=>PB5 <3=>PB8 <4=>PB12
#define UART5_RX_ID 0
#if (UART5_RX_ID == 0)
#define UART5_RX 0
#elif (UART5_RX_ID == 1)
#define UART5_RX      1
#define UART5_RX_PORT D
#define UART5_RX_PIN  GPIO_PIN_2
#elif (UART5_TX_ID == 2)
#define UART5_TX      1
#define UART5_TX_PORT B
#define UART5_TX_PIN  GPIO_PIN_5
#elif (UART5_TX_ID == 3)
#define UART5_TX      1
#define UART5_TX_PORT B
#define UART5_TX_PIN  GPIO_PIN_8
#elif (UART5_TX_ID == 4)
#define UART5_TX      1
#define UART5_TX_PORT B
#define UART5_TX_PIN  GPIO_PIN_12
#else
#error "Invalid UART5_RX Pin Configuration!"
#endif

//   <o> UART5 Interrupt Priority <0-15>
//   <i> The Interrupt Priority of UART5
#define UART5_IT_PRIORITY        2
//   <o> UART5 Interrupt SubPriority <0-15>
//   <i> The Interrupt SubPriority of UART5
#define UART5_IT_SUB             3

//   <e> DMA Rx
//     <o1> Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <0=>0
//     <i>  Selects DMA Stream (only Stream 0 can be used)
//     <o3> Channel <4=>4
//     <i>  Selects DMA Channel (only Channel 4 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//     <o5> DMA Rx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Rx
//     <o6> DMA Rx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Rx
//     <o7> The size of Receive buf [byte]
//     <i>  Using FIFO and Buf to implement high reliable USART Receive
//     <o8> The size of Receive FIFO [byte] (Must be power of 2)
//     <i>  Using FIFO and Buf to implement high reliable USART Receive
//   </e>
#define UART5_RX_DMA             0
#define UART5_RX_DMA_NUMBER      1
#define UART5_RX_DMA_STREAM      0
#define UART5_RX_DMA_CHANNEL     4
#define UART5_RX_DMA_PRIORITY    0
#define UART5_RX_DMA_IT_PRIORITY 2
#define UART5_RX_DMA_IT_SUB      2
#define UART5_RX_DMA_BUF_SIZE    256
#define UART5_RX_DMA_FIFO_SIZE   256

//   <e> DMA Tx
//     <o1> Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <7=>7
//     <i>  Selects DMA Stream (only Stream 7 can be used)
//     <o3> Channel <4=>4 <8=>8
//     <i>  Selects DMA Channel (only Channel 4 or 8 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//     <o5> DMA Tx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Tx
//     <o6> DMA Tx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Tx
//     <o7> The size of Send buf [byte]
//     <i>  Write data to Send buf, and sending with thread safety
//   </e>
#define UART5_TX_DMA             0
#define UART5_TX_DMA_NUMBER      1
#define UART5_TX_DMA_STREAM      7
#define UART5_TX_DMA_CHANNEL     4
#define UART5_TX_DMA_PRIORITY    0
#define UART5_TX_DMA_IT_PRIORITY 1
#define UART5_TX_DMA_IT_SUB      4
#define UART5_TX_DMA_BUF_SIZE    256

// </e>

// <e> USART6 (Universal synchronous asynchronous receiver transmitter)
#define USART6_ENABLE            0

//   <o> USART6_TX Pin <0=>Not Used <1=>PA11 <2=>PC6 <3=>PG14
#define USART6_TX_ID             0
#if (USART6_TX_ID == 0)
#define USART6_TX 0
#elif (USART6_TX_ID == 1)
#define USART6_TX      1
#define USART6_TX_PORT A
#define USART6_TX_PIN  GPIO_PIN_11
#elif (USART6_TX_ID == 2)
#define USART6_TX      1
#define USART6_TX_PORT C
#define USART6_TX_PIN  GPIO_PIN_6
#elif (USART6_TX_ID == 3)
#define USART6_TX      1
#define USART6_TX_PORT G
#define USART6_TX_PIN  GPIO_PIN_14
#else
#error "Invalid USART6_TX Pin Configuration!"
#endif

//   <o> USART6_RX Pin <0=>Not Used <1=>PA12 <2=>PC7 <3=>PG9
#define USART6_RX_ID 0
#if (USART6_RX_ID == 0)
#define USART6_RX 0
#elif (USART6_RX_ID == 1)
#define USART6_RX      1
#define USART6_RX_PORT A
#define USART6_RX_PIN  GPIO_PIN_12
#elif (USART6_RX_ID == 2)
#define USART6_RX      1
#define USART6_RX_PORT C
#define USART6_RX_PIN  GPIO_PIN_7
#elif (USART6_RX_ID == 3)
#define USART6_RX      1
#define USART6_RX_PORT G
#define USART6_RX_PIN  GPIO_PIN_9
#else
#error "Invalid USART6_RX Pin Configuration!"
#endif

//   <o> USART6_CTS Pin <0=>Not Used <1=>PG13 <2=>PG15
#define USART6_CTS_ID 0
#if (USART6_CTS_ID == 0)
#define USART6_CTS 0
#elif (USART6_CTS_ID == 1)
#define USART6_CTS      1
#define USART6_CTS_PORT G
#define USART6_CTS_PIN  GPIO_PIN_13
#elif (USART6_CTS_ID == 2)
#define USART6_CTS      1
#define USART6_CTS_PORT G
#define USART6_CTS_PIN  GPIO_PIN_15
#else
#error "Invalid USART6_CTS Pin Configuration!"
#endif

//   <o> USART6_RTS Pin <0=>Not Used <1=>PG8 <2=>PG12
#define USART6_RTS_ID 0
#if (USART6_RTS_ID == 0)
#define USART6_RTS 0
#elif (USART6_RTS_ID == 1)
#define USART6_RTS      1
#define USART6_RTS_PORT G
#define USART6_RTS_PIN  GPIO_PIN_8
#elif (USART6_RTS_ID == 2)
#define USART6_RTS      1
#define USART6_RTS_PORT G
#define USART6_RTS_PIN  GPIO_PIN_12
#else
#error "Invalid USART6_RTS Pin Configuration!"
#endif

//   <o> USART6 Interrupt Priority <0-15>
//   <i> The Interrupt Priority of USART6
#define USART6_IT_PRIORITY        2
//   <o> USART6 Interrupt SubPriority <0-15>
//   <i> The Interrupt SubPriority of USART6
#define USART6_IT_SUB             3

