Deadline039/STM32F4xx-HAL-CSP/Config/CSP_Config.h
//   <e> DMA Rx
//     <o1> Number <2=>2
//     <i>  Selects DMA Number (only DMA2 can be used)
//     <o2> Stream <1=>1 <2=>2
//     <i>  Selects DMA Stream (only Stream 1 or 2 can be used)
//     <o3> Channel <5=>5
//     <i>  Selects DMA Channel (only Channel 5 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//     <o5> DMA Rx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Rx
//     <o6> DMA Rx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Rx
//     <o7> The size of Receive buf [byte]
//     <i>  Using FIFO and Buf to implement high reliable USART Receive
//     <o8> The size of Receive FIFO [byte] (Must be power of 2)
//     <i>  Using FIFO and Buf to implement high reliable USART Receive
//   </e>
#define USART6_RX_DMA             0
#define USART6_RX_DMA_NUMBER      2
#define USART6_RX_DMA_STREAM      1
#define USART6_RX_DMA_CHANNEL     5
#define USART6_RX_DMA_PRIORITY    0
#define USART6_RX_DMA_IT_PRIORITY 2
#define USART6_RX_DMA_IT_SUB      2
#define USART6_RX_DMA_BUF_SIZE    256
#define USART6_RX_DMA_FIFO_SIZE   256

//   <e> DMA Tx
//     <o1> Number <2=>2
//     <i>  Selects DMA Number (only DMA2 can be used)
//     <o2> Stream <6=>6 <7=>7
//     <i>  Selects DMA Stream (only Stream 6 or 7 can be used)
//     <o3> Channel <5=>5
//     <i>  Selects DMA Channel (only Channel 5 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//     <o5> DMA Tx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Tx
//     <o6> DMA Tx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Tx
//     <o7> The size of Send buf [byte]
//     <i>  Write data to Send buf, and sending with thread safety
//   </e>
#define USART6_TX_DMA             0
#define USART6_TX_DMA_NUMBER      2
#define USART6_TX_DMA_STREAM      6
#define USART6_TX_DMA_CHANNEL     5
#define USART6_TX_DMA_PRIORITY    0
#define USART6_TX_DMA_IT_PRIORITY 1
#define USART6_TX_DMA_IT_SUB      4
#define USART6_TX_DMA_BUF_SIZE    256

// </e>

// <e> UART7 (Universal asynchronous receiver transmitter)
#define UART7_ENABLE              0

//   <o> UART7_TX Pin <0=>Not Used <1=>PF7 <2=>PE8 <3=>PA15 <4=>PB4
#define UART7_TX_ID               0
#if (UART7_TX_ID == 0)
#define UART7_TX 0
#elif (UART7_TX_ID == 1)
#define UART7_TX      1
#define UART7_TX_PORT F
#define UART7_TX_PIN  GPIO_PIN_7
#elif (UART7_TX_ID == 2)
#define UART7_TX      1
#define UART7_TX_PORT E
#define UART7_TX_PIN  GPIO_PIN_8
#elif (UART7_TX_ID == 3)
#define UART7_TX      1
#define UART7_TX_PORT A
#define UART7_TX_PIN  GPIO_PIN_15
#elif (UART7_TX_ID == 4)
#define UART7_TX      1
#define UART7_TX_PORT B
#define UART7_TX_PIN  GPIO_PIN_4
#else
#error "Invalid UART7_TX Pin Configuration!"
#endif

//   <o> UART7_RX Pin <0=>Not Used <1=>PF6 <2=>PE7 <3=>PA8 <4=>PB3
#define UART7_RX_ID 0
#if (UART7_RX_ID == 0)
#define UART7_RX 0
#elif (UART7_RX_ID == 1)
#define UART7_RX      1
#define UART7_RX_PORT F
#define UART7_RX_PIN  GPIO_PIN_6
#elif (UART7_RX_ID == 2)
#define UART7_RX      1
#define UART7_RX_PORT E
#define UART7_RX_PIN  GPIO_PIN_7
#elif (UART7_RX_ID == 3)
#define UART7_RX      1
#define UART7_RX_PORT A
#define UART7_RX_PIN  GPIO_PIN_8
#elif (UART7_RX_ID == 4)
#define UART7_RX      1
#define UART7_RX_PORT B
#define UART7_RX_PIN  GPIO_PIN_3
#else
#error "Invalid UART7_RX Pin Configuration!"
#endif

//   <o> UART7 Interrupt Priority <0-15>
//   <i> The Interrupt Priority of UART7
#define UART7_IT_PRIORITY        2
//   <o> UART7 Interrupt SubPriority <0-15>
//   <i> The Interrupt SubPriority of UART7
#define UART7_IT_SUB             3

//   <e> DMA Rx
//     <o1> Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <3=>3
//     <i>  Selects DMA Stream (only Stream 3 can be used)
//     <o3> Channel <5=>5
//     <i>  Selects DMA Channel (only Channel 5 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//     <o5> DMA Rx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Rx
//     <o6> DMA Rx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Rx
//     <o7> The size of Receive buf [byte]
//     <i>  Using FIFO and Buf to implement high reliable USART Receive
//     <o8> The size of Receive FIFO [byte] (Must be power of 2)
//     <i>  Using FIFO and Buf to implement high reliable USART Receive
//   </e>
#define UART7_RX_DMA             0
#define UART7_RX_DMA_NUMBER      1
#define UART7_RX_DMA_STREAM      3
#define UART7_RX_DMA_CHANNEL     5
#define UART7_RX_DMA_PRIORITY    0
#define UART7_RX_DMA_IT_PRIORITY 2
#define UART7_RX_DMA_IT_SUB      2
#define UART7_RX_DMA_BUF_SIZE    256
#define UART7_RX_DMA_FIFO_SIZE   256

//   <e> DMA Tx
//     <o1> Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <1=>1
//     <i>  Selects DMA Stream (only Stream 1 can be used)
//     <o3> Channel <5=>5
//     <i>  Selects DMA Channel (only Channel 5 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//     <o5> DMA Tx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Tx
//     <o6> DMA Tx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Tx
//     <o7> The size of Send buf [byte]
//     <i>  Write data to Send buf, and sending with thread safety
//   </e>
#define UART7_TX_DMA             0
#define UART7_TX_DMA_NUMBER      1
#define UART7_TX_DMA_STREAM      1
#define UART7_TX_DMA_CHANNEL     5
#define UART7_TX_DMA_PRIORITY    0
#define UART7_TX_DMA_IT_PRIORITY 1
#define UART7_TX_DMA_IT_SUB      4
#define UART7_TX_DMA_BUF_SIZE    256

// </e>

// <e> UART8 (Universal asynchronous receiver transmitter)
#define UART8_ENABLE             0

//   <o> UART8_TX Pin <0=>Not Used <1=>PE1 <2=>PF9
#define UART8_TX_ID              0
#if (UART8_TX_ID == 0)
#define UART8_TX 0
#elif (UART8_TX_ID == 1)
#define UART8_TX      1
#define UART8_TX_PORT E
#define UART8_TX_PIN  GPIO_PIN_1
#elif (UART8_TX_ID == 2)
#define UART8_TX      1
#define UART8_TX_PORT F
#define UART8_TX_PIN  GPIO_PIN_9
#else
#error "Invalid UART8_TX Pin Configuration!"
#endif

//   <o> UART8_RX Pin <0=>Not Used <1=>PE0 <2=>PF8
#define UART8_RX_ID 0
#if (UART8_RX_ID == 0)
#define UART8_RX 0
#elif (UART8_RX_ID == 1)
#define UART8_RX      1
#define UART8_RX_PORT E
#define UART8_RX_PIN  GPIO_PIN_0
#elif (UART8_RX_ID == 2)
#define UART8_RX      1
#define UART8_RX_PORT F
#define UART8_RX_PIN  GPIO_PIN_8
#else
#error "Invalid UART8_RX Pin Configuration!"
#endif

//   <o> UART8 Interrupt Priority <0-15>
//   <i> The Interrupt Priority of UART8
#define UART8_IT_PRIORITY        2
//   <o> UART8 Interrupt SubPriority <0-15>
//   <i> The Interrupt SubPriority of UART8
#define UART8_IT_SUB             3

