Deadline039/STM32F4xx-HAL-CSP/Config/CSP_Config.h
//   <e> DMA Rx
//     <o1> Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <6=>6
//     <i>  Selects DMA Stream (only Stream 6 can be used)
//     <o3> Channel <5=>5
//     <i>  Selects DMA Channel (only Channel 5 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//     <o5> DMA Rx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Rx
//     <o6> DMA Rx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Rx
//     <o7> The size of Receive buf [byte]
//     <i>  Using FIFO and Buf to implement high reliable USART Receive
//     <o8> The size of Receive FIFO [byte] (Must be power of 2)
//     <i>  Using FIFO and Buf to implement high reliable USART Receive
//   </e>
#define UART8_RX_DMA             0
#define UART8_RX_DMA_NUMBER      1
#define UART8_RX_DMA_STREAM      6
#define UART8_RX_DMA_CHANNEL     5
#define UART8_RX_DMA_PRIORITY    0
#define UART8_RX_DMA_IT_PRIORITY 2
#define UART8_RX_DMA_IT_SUB      2
#define UART8_RX_DMA_BUF_SIZE    256
#define UART8_RX_DMA_FIFO_SIZE   256

//   <e> DMA Tx
//     <o1> Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <0=>0
//     <i>  Selects DMA Stream (only Stream 0 can be used)
//     <o3> Channel <5=>5
//     <i>  Selects DMA Channel (only Channel 5 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//     <o5> DMA Tx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Tx
//     <o6> DMA Tx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Tx
//     <o7> The size of Send buf [byte]
//     <i>  Write data to Send buf, and sending with thread safety
//   </e>
#define UART8_TX_DMA             0
#define UART8_TX_DMA_NUMBER      1
#define UART8_TX_DMA_STREAM      0
#define UART8_TX_DMA_CHANNEL     5
#define UART8_TX_DMA_PRIORITY    0
#define UART8_TX_DMA_IT_PRIORITY 1
#define UART8_TX_DMA_IT_SUB      4
#define UART8_TX_DMA_BUF_SIZE    256

// </e>

// <e> UART9 (Universal asynchronous receiver transmitter)
#define UART9_ENABLE             0

//   <o> UART9_TX Pin <0=>Not Used <1=>PD15 <2=>PG1
#define UART9_TX_ID              0
#if (UART9_TX_ID == 0)
#define UART9_TX 0
#elif (UART9_TX_ID == 1)
#define UART9_TX      1
#define UART9_TX_PORT D
#define UART9_TX_PIN  GPIO_PIN_15
#elif (UART9_TX_ID == 2)
#define UART9_TX      1
#define UART9_TX_PORT G
#define UART9_TX_PIN  GPIO_PIN_1
#else
#error "Invalid UART9_TX Pin Configuration!"
#endif

//   <o> UART9_RX Pin <0=>Not Used <1=>PD14 <2=>PG0
#define UART9_RX_ID 0
#if (UART9_RX_ID == 0)
#define UART9_RX 0
#elif (UART9_RX_ID == 1)
#define UART9_RX      1
#define UART9_RX_PORT D
#define UART9_RX_PIN  GPIO_PIN_14
#elif (UART9_RX_ID == 2)
#define UART9_RX      1
#define UART9_RX_PORT G
#define UART9_RX_PIN  GPIO_PIN_0
#else
#error "Invalid UART9_RX Pin Configuration!"
#endif

//   <o> UART9 Interrupt Priority <0-15>
//   <i> The Interrupt Priority of UART9
#define UART9_IT_PRIORITY        2
//   <o> UART9 Interrupt SubPriority <0-15>
//   <i> The Interrupt SubPriority of UART9
#define UART9_IT_SUB             3

//   <e> DMA Rx
//     <o1> Number <2=>2
//     <i>  Selects DMA Number (only DMA2 can be used)
//     <o2> Stream <7=>7
//     <i>  Selects DMA Stream (only Stream 7 can be used)
//     <o3> Channel <0=>0
//     <i>  Selects DMA Channel (only Channel 0 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//     <o5> DMA Rx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Rx
//     <o6> DMA Rx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Rx
//     <o7> The size of Receive buf [byte]
//     <i>  Using FIFO and Buf to implement high reliable USART Receive
//     <o8> The size of Receive FIFO [byte] (Must be power of 2)
//     <i>  Using FIFO and Buf to implement high reliable USART Receive
//   </e>
#define UART9_RX_DMA             0
#define UART9_RX_DMA_NUMBER      1
#define UART9_RX_DMA_STREAM      6
#define UART9_RX_DMA_CHANNEL     5
#define UART9_RX_DMA_PRIORITY    0
#define UART9_RX_DMA_IT_PRIORITY 2
#define UART9_RX_DMA_IT_SUB      2
#define UART9_RX_DMA_BUF_SIZE    256
#define UART9_RX_DMA_FIFO_SIZE   256

//   <e> DMA Tx
//     <o1> Number <2=>2
//     <i>  Selects DMA Number (only DMA2 can be used)
//     <o2> Stream <0=>0
//     <i>  Selects DMA Stream (only Stream 0 can be used)
//     <o3> Channel <1=>1
//     <i>  Selects DMA Channel (only Channel 1 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//     <o5> DMA Tx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Tx
//     <o6> DMA Tx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Tx
//     <o7> The size of Send buf [byte]
//     <i>  Write data to Send buf, and sending with thread safety
//   </e>
#define UART9_TX_DMA             0
#define UART9_TX_DMA_NUMBER      1
#define UART9_TX_DMA_STREAM      0
#define UART9_TX_DMA_CHANNEL     5
#define UART9_TX_DMA_PRIORITY    0
#define UART9_TX_DMA_IT_PRIORITY 1
#define UART9_TX_DMA_IT_SUB      4
#define UART9_TX_DMA_BUF_SIZE    256

// </e>

// <e> UART10 (Universal asynchronous receiver transmitter)
#define UART10_ENABLE            0

//   <o> UART10_TX Pin <0=>Not Used <1=>PE3 <2=>PG12
#define UART10_TX_ID             0
#if (UART10_TX_ID == 0)
#define UART10_TX 0
#elif (UART10_TX_ID == 1)
#define UART10_TX      1
#define UART10_TX_PORT E
#define UART10_TX_PIN  GPIO_PIN_3
#elif (UART10_TX_ID == 2)
#define UART10_TX      1
#define UART10_TX_PORT G
#define UART10_TX_PIN  GPIO_PIN_12
#else
#error "Invalid UART10_TX Pin Configuration!"
#endif

//   <o> UART10_RX Pin <0=>Not Used <1=>PE2 <2=>PG11
#define UART10_RX_ID 0
#if (UART10_RX_ID == 0)
#define UART10_RX 0
#elif (UART10_RX_ID == 1)
#define UART10_RX      1
#define UART10_RX_PORT E
#define UART10_RX_PIN  GPIO_PIN_2
#elif (UART10_RX_ID == 2)
#define UART10_RX      1
#define UART10_RX_PORT G
#define UART10_RX_PIN  GPIO_PIN_11
#else
#error "Invalid UART10_RX Pin Configuration!"
#endif

//   <o> UART10 Interrupt Priority <0-15>
//   <i> The Interrupt Priority of UART10
#define UART10_IT_PRIORITY        2
//   <o> UART10 Interrupt SubPriority <0-15>
//   <i> The Interrupt SubPriority of UART10
#define UART10_IT_SUB             3

