Deadline039/STM32F4xx-HAL-CSP/Config/CSP_Config.h
//   <e> DMA Rx
//     <o1> Number <2=>2
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <0=>0 <3=>3
//     <i>  Selects DMA Stream (only Stream 0 or 3 can be used)
//     <o3> Channel <5=>5 <9=>9
//     <i>  Selects DMA Channel (only Channel 5 or 9 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//     <o5> DMA Rx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Rx
//     <o6> DMA Rx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Rx
//     <o7> The size of Receive buf [byte]
//     <i>  Using FIFO and Buf to implement high reliable USART Receive
//     <o8> The size of Receive FIFO [byte] (Must be power of 2)
//     <i>  Using FIFO and Buf to implement high reliable USART Receive
//   </e>
#define UART10_RX_DMA             0
#define UART10_RX_DMA_NUMBER      1
#define UART10_RX_DMA_STREAM      6
#define UART10_RX_DMA_CHANNEL     5
#define UART10_RX_DMA_PRIORITY    0
#define UART10_RX_DMA_IT_PRIORITY 2
#define UART10_RX_DMA_IT_SUB      2
#define UART10_RX_DMA_BUF_SIZE    256
#define UART10_RX_DMA_FIFO_SIZE   256

//   <e> DMA Tx
//     <o1> Number <2=>2
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <7=>7 <3=>5
//     <i>  Selects DMA Stream (only Stream 7 or 5 can be used)
//     <o3> Channel <6=>6 <9=>9
//     <i>  Selects DMA Channel (only Channel 6 or 9 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//     <o5> DMA Tx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Tx
//     <o6> DMA Tx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Tx
//     <o7> The size of Send buf [byte]
//     <i>  Write data to Send buf, and sending with thread safety
//   </e>
#define UART10_TX_DMA             0
#define UART10_TX_DMA_NUMBER      1
#define UART10_TX_DMA_STREAM      0
#define UART10_TX_DMA_CHANNEL     5
#define UART10_TX_DMA_PRIORITY    0
#define UART10_TX_DMA_IT_PRIORITY 1
#define UART10_TX_DMA_IT_SUB      4
#define UART10_TX_DMA_BUF_SIZE    256

// </e>

// <e> I2C1 (Inter-integrated Circuit Interface 1)
#define I2C1_ENABLE               0

//   <o> I2C1_SCL Pin <0=>PB6 <1=>PB8
#define I2C1_SCL_PORT_ID          0
#if (I2C1_SCL_PORT_ID == 0)
#define I2C1_SCL_PORT B
#define I2C1_SCL_PIN  GPIO_PIN_6
#elif (I2C1_SCL_PORT_ID == 1)
#define I2C1_SCL_PORT B
#define I2C1_SCL_PIN  GPIO_PIN_8
#else
#error "Invalid I2C1_SCL Pin Configuration!"
#endif

//   <o> I2C1_SDA Pin <0=>PB7 <1=>PB9
#define I2C1_SDA_PORT_ID 0
#if (I2C1_SDA_PORT_ID == 0)
#define I2C1_SDA_PORT B
#define I2C1_SDA_PIN  GPIO_PIN_7
#elif (I2C1_SDA_PORT_ID == 1)
#define I2C1_SDA_PORT B
#define I2C1_SDA_PIN  GPIO_PIN_9
#else
#error "Invalid I2C1_SDA Pin Configuration!"
#endif

//   <e> I2C1 Interrupt
//   <i> Must be enabled when using DMA.
#define I2C1_IT_ENABLE          0
//      <o> I2C1 Interrupt Priority <0-15>
//      <i> The Interrupt Priority of I2C1
#define I2C1_IT_PRIORITY        2
//      <o> I2C1 Interrupt SubPriority <0-15>
//      <i> The Interrupt SubPriority of I2C1
#define I2C1_IT_SUB             3
//   </e>

//   <e> DMA Rx
//     <o1> Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <0=>0 <5=>5
//     <i>  Selects DMA Stream (only Stream 0 or 5 can be used)
//     <o3> Channel <1=>1
//     <i>  Selects DMA Channel (only Channel 1 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//     <o5> DMA Rx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Rx
//     <o6> DMA Rx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Rx
//   </e>
#define I2C1_RX_DMA             0
#define I2C1_RX_DMA_NUMBER      1
#define I2C1_RX_DMA_STREAM      0
#define I2C1_RX_DMA_CHANNEL     1
#define I2C1_RX_DMA_PRIORITY    0
#define I2C1_RX_DMA_IT_PRIORITY 2
#define I2C1_RX_DMA_IT_SUB      2

//   <e> DMA Tx
//     <o1> Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <1=>1 <6=>6 <7=>7
//     <i>  Selects DMA Stream (only Stream 1 or 6 or 7 can be used)
//     <o3> Channel <0=>0 <1=>1
//     <i>  Selects DMA Channel (only Channel 0 or 1 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//     <o5> DMA Tx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Tx
//     <o6> DMA Tx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Tx
//   </e>
#define I2C1_TX_DMA             0
#define I2C1_TX_DMA_NUMBER      1
#define I2C1_TX_DMA_STREAM      6
#define I2C1_TX_DMA_CHANNEL     1
#define I2C1_TX_DMA_PRIORITY    0
#define I2C1_TX_DMA_IT_PRIORITY 1
#define I2C1_TX_DMA_IT_SUB      4

// </e>

// <e> I2C2 (Inter-integrated Circuit Interface 2)
#define I2C2_ENABLE             0

//   <o> I2C2_SCL Pin <0=>PF1 <1=>PH4 <2=>PB10
#define I2C2_SCL_PORT_ID        1
#if (I2C2_SCL_PORT_ID == 0)
#define I2C2_SCL_PORT F
#define I2C2_SCL_PIN  GPIO_PIN_1
#elif (I2C2_SCL_PORT_ID == 1)
#define I2C2_SCL_PORT H
#define I2C2_SCL_PIN  GPIO_PIN_4
#elif (I2C2_SCL_PORT_ID == 2)
#define I2C2_SCL_PORT B
#define I2C2_SCL_PIN  GPIO_PIN_10
#else
#error "Invalid I2C2_SCL Pin Configuration!"
#endif

//   <o> I2C2_SDA Pin <0=>PF0 <1=>PH5 <2=>PB11 <3=>PB3 <4=>PB9
#define I2C2_SDA_PORT_ID 1
#if (I2C2_SDA_PORT_ID == 0)
#define I2C2_SDA_PORT F
#define I2C2_SDA_PIN  GPIO_PIN_0
#elif (I2C2_SDA_PORT_ID == 1)
#define I2C2_SDA_PORT H
#define I2C2_SDA_PIN  GPIO_PIN_5
#elif (I2C2_SDA_PORT_ID == 2)
#define I2C2_SDA_PORT B
#define I2C2_SDA_PIN  GPIO_PIN_11
#elif (I2C2_SDA_PORT_ID == 3)
#define I2C2_SDA_PORT B
#define I2C2_SDA_PIN  GPIO_PIN_3
#elif (I2C2_SDA_PORT_ID == 4)
#define I2C2_SDA_PORT B
#define I2C2_SDA_PIN  GPIO_PIN_9
#else
#error "Invalid I2C2_SDA Pin Configuration!"
#endif

//   <e> I2C2 Interrupt
//   <i> Must be enabled when using DMA.
#define I2C2_IT_ENABLE          0
//      <o> I2C2 Interrupt Priority <0-15>
//      <i> The Interrupt Priority of I2C2
#define I2C2_IT_PRIORITY        2
//      <o> I2C2 Interrupt SubPriority <0-15>
//      <i> The Interrupt SubPriority of I2C2
#define I2C2_IT_SUB             3
//   </e>

