Deadline039/STM32F4xx-HAL-CSP/Config/CSP_Config.h
//   <e> DMA Rx
//     <o1> Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <2=>2 <3=>3
//     <i>  Selects DMA Stream (only Stream 2 or 3 can be used)
//     <o3> Channel <7=>7
//     <i>  Selects DMA Channel (only Channel 7 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//     <o5> DMA Rx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Rx
//     <o6> DMA Rx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Rx
//   </e>
#define I2C2_RX_DMA             0
#define I2C2_RX_DMA_NUMBER      1
#define I2C2_RX_DMA_STREAM      2
#define I2C2_RX_DMA_CHANNEL     7
#define I2C2_RX_DMA_PRIORITY    0
#define I2C2_RX_DMA_IT_PRIORITY 2
#define I2C2_RX_DMA_IT_SUB      2

//   <e> DMA Tx
//     <o1> Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <7=>7
//     <i>  Selects DMA Stream (only Stream 7 can be used)
//     <o3> Channel <7=>7
//     <i>  Selects DMA Channel (only Channel 1 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//     <o5> DMA Tx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Tx
//     <o6> DMA Tx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Tx
//   </e>
#define I2C2_TX_DMA             0
#define I2C2_TX_DMA_NUMBER      1
#define I2C2_TX_DMA_STREAM      7
#define I2C2_TX_DMA_CHANNEL     7
#define I2C2_TX_DMA_PRIORITY    0
#define I2C2_TX_DMA_IT_PRIORITY 1
#define I2C2_TX_DMA_IT_SUB      4

// </e>

// <e> I2C3 (Inter-integrated Circuit Interface 3)
#define I2C3_ENABLE             0

//   <o> I2C3_SCL Pin <0=>PH7 <1=>PA8
#define I2C3_SCL_PORT_ID        0
#if (I2C3_SCL_PORT_ID == 0)
#define I2C3_SCL_PORT H
#define I2C3_SCL_PIN  GPIO_PIN_7
#elif (I2C3_SCL_PORT_ID == 1)
#define I2C3_SCL_PORT A
#define I2C3_SCL_PIN  GPIO_PIN_8
#else
#error "Invalid I2C3_SCL Pin Configuration!"
#endif

//   <o> I2C3_SDA Pin <0=>PH8 <1=>PC9 <2=>PB4 <3=>PB8
#define I2C3_SDA_PORT_ID 0
#if (I2C3_SDA_PORT_ID == 0)
#define I2C3_SDA_PORT H
#define I2C3_SDA_PIN  GPIO_PIN_8
#elif (I2C3_SDA_PORT_ID == 1)
#define I2C3_SDA_PORT C
#define I2C3_SDA_PIN  GPIO_PIN_9
#elif (I2C3_SDA_PORT_ID == 2)
#define I2C3_SDA_PORT B
#define I2C3_SDA_PIN  GPIO_PIN_4
#elif (I2C3_SDA_PORT_ID == 3)
#define I2C3_SDA_PORT B
#define I2C3_SDA_PIN  GPIO_PIN_8
#else
#error "Invalid I2C3_SDA Pin Configuration!"
#endif

//   <e> I2C3 Interrupt
//   <i> Must be enabled when using DMA.
#define I2C3_IT_ENABLE          0
//      <o> I2C3 Interrupt Priority <0-15>
//      <i> The Interrupt Priority of I2C3
#define I2C3_IT_PRIORITY        2
//      <o> I2C3 Interrupt SubPriority <0-15>
//      <i> The Interrupt SubPriority of I2C3
#define I2C3_IT_SUB             3
//   </e>

//   <e> DMA Rx
//     <o1> Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <1=>1 <2=>2
//     <i>  Selects DMA Stream (only Stream 1 or 2 can be used)
//     <o3> Channel <1=>1 <3=>3
//     <i>  Selects DMA Channel (only Channel 1 or 3 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//     <o5> DMA Rx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Rx
//     <o6> DMA Rx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Rx
//   </e>
#define I2C3_RX_DMA             0
#define I2C3_RX_DMA_NUMBER      1
#define I2C3_RX_DMA_STREAM      2
#define I2C3_RX_DMA_CHANNEL     3
#define I2C3_RX_DMA_PRIORITY    0
#define I2C3_RX_DMA_IT_PRIORITY 2
#define I2C3_RX_DMA_IT_SUB      2

//   <e> DMA Tx
//     <o1> Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <4=>4 <5=>5
//     <i>  Selects DMA Stream (only Stream 4 or 5 can be used)
//     <o3> Channel <3=>3 <6=>6
//     <i>  Selects DMA Channel (only Channel 3 or 6 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//     <o5> DMA Tx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Tx
//     <o6> DMA Tx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Tx
//   </e>
#define I2C3_TX_DMA             0
#define I2C3_TX_DMA_NUMBER      1
#define I2C3_TX_DMA_STREAM      4
#define I2C3_TX_DMA_CHANNEL     3
#define I2C3_TX_DMA_PRIORITY    0
#define I2C3_TX_DMA_IT_PRIORITY 1
#define I2C3_TX_DMA_IT_SUB      4

// </e>

// <e> SPI1 (Serial Peripheral Interface 1)
#define SPI1_ENABLE             0

//   <o> SPI1_MISO Pin <0=>Not Used <1=>PA6 <2=>PB4
#define SPI1_MISO_PORT_ID       0
#if (SPI1_MISO_PORT_ID == 0)
#define SPI1_MISO 0
#elif (SPI1_MISO_PORT_ID == 1)
#define SPI1_MISO      1
#define SPI1_MISO_PORT A
#define SPI1_MISO_PIN  GPIO_PIN_6
#elif (SPI1_MISO_PORT_ID == 2)
#define SPI1_MISO      1
#define SPI1_MISO_PORT B
#define SPI1_MISO_PIN  GPIO_PIN_4
#else
#error "Invalid SPI1_MISO Pin Configuration!"
#endif

//   <o> SPI1_MOSI Pin <0=>Not Used <1=>PA7 <2=>PB5
#define SPI1_MOSI_PORT_ID 0
#if (SPI1_MOSI_PORT_ID == 0)
#define SPI1_MOSI 0
#elif (SPI1_MOSI_PORT_ID == 1)
#define SPI1_MOSI      1
#define SPI1_MOSI_PORT A
#define SPI1_MOSI_PIN  GPIO_PIN_7
#elif (SPI1_MOSI_PORT_ID == 2)
#define SPI1_MOSI      1
#define SPI1_MOSI_PORT B
#define SPI1_MOSI_PIN  GPIO_PIN_5
#else
#error "Invalid SPI1_MOSI Pin Configuration!"
#endif

//   <o> SPI1_SCK Pin <0=>PA5 <1=>PB3
#define SPI1_SCK_PORT_ID 0
#if (SPI1_SCK_PORT_ID == 0)
#define SPI1_SCK_PORT A
#define SPI1_SCK_PIN  GPIO_PIN_5
#elif (SPI1_SCK_PORT_ID == 1)
#define SPI1_SCK_PORT B
#define SPI1_SCK_PIN  GPIO_PIN_3
#else
#error "Invalid SPI1_SCK Pin Configuration!"
#endif

//   <o> SPI1_NSS Pin <0=>Not Used <1=>PA4 <2=>PA15
#define SPI1_NSS_PORT_ID 0
#if (SPI1_NSS_PORT_ID == 0)
#define SPI1_NSS 0
#elif (SPI1_NSS_PORT_ID == 1)
#define SPI1_NSS      1
#define SPI1_NSS_PORT A
#define SPI1_NSS_PIN  GPIO_PIN_4
#elif (SPI1_NSS_PORT_ID == 2)
#define SPI1_NSS      1
#define SPI1_NSS_PORT A
#define SPI1_NSS_PIN  GPIO_PIN_15
#else
#error "Invalid SPI1_NSS Pin Configuration!"
#endif

