Deadline039/STM32F4xx-HAL-CSP/Config/CSP_Config.h
//   <e> SPI1 Interrupt
//   <i> Must be enabled when using DMA.
#define SPI1_IT_ENABLE          0
//     <o> SPI1 Interrupt Priority <0-15>
//     <i> The Interrupt Priority of SPI1
#define SPI1_IT_PRIORITY        2
//     <o> SPI1 Interrupt SubPriority <0-15>
//     <i> The Interrupt SubPriority of SPI1
#define SPI1_IT_SUB             3
//   </e>

//   <e> DMA Rx
//     <o1> Number <2=>2
//     <i>  Selects DMA Number (only DMA2 can be used)
//     <o2> Stream <0=>0 <2=>2
//     <i>  Selects DMA Stream (only Stream 0 or 2 can be used)
//     <o3> Channel <3=>3
//     <i>  Selects DMA Channel (only Channel 3 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//     <o5> DMA Rx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Rx
//     <o6> DMA Rx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Rx
//   </e>
#define SPI1_RX_DMA             0
#define SPI1_RX_DMA_NUMBER      2
#define SPI1_RX_DMA_STREAM      0
#define SPI1_RX_DMA_CHANNEL     3
#define SPI1_RX_DMA_PRIORITY    0
#define SPI1_RX_DMA_IT_PRIORITY 2
#define SPI1_RX_DMA_IT_SUB      4

//   <e> DMA Tx
//     <o1> Number <2=>2
//     <i>  Selects DMA Number (only DMA2 can be used)
//     <o2> Stream <2=>2 <3=>3 <5=>5
//     <i>  Selects DMA Stream (only Stream 2 or 3 or 5 can be used)
//     <o3> Channel <2=>2 <3=>3
//     <i>  Selects DMA Channel (only Channel 2 or 3 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//     <o5> DMA Tx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Tx
//     <o6> DMA Tx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Tx
//   </e>
#define SPI1_TX_DMA             0
#define SPI1_TX_DMA_NUMBER      2
#define SPI1_TX_DMA_STREAM      5
#define SPI1_TX_DMA_CHANNEL     3
#define SPI1_TX_DMA_PRIORITY    0
#define SPI1_TX_DMA_IT_PRIORITY 2
#define SPI1_TX_DMA_IT_SUB      2

// </e>

// <e> SPI2 (Serial Peripheral Interface 2)
#define SPI2_ENABLE             0

//   <o> SPI2_MISO Pin <0=>Not Used <1=>PB14 <2=>PC2 <3=>PI2 <4=>PA12
#define SPI2_MISO_PORT_ID       0
#if (SPI2_MISO_PORT_ID == 0)
#define SPI2_MISO 0
#elif (SPI2_MISO_PORT_ID == 1)
#define SPI2_MISO      1
#define SPI2_MISO_PORT B
#define SPI2_MISO_PIN  GPIO_PIN_14
#elif (SPI2_MISO_PORT_ID == 2)
#define SPI2_MISO      1
#define SPI2_MISO_PORT C
#define SPI2_MISO_PIN  GPIO_PIN_2
#elif (SPI2_MISO_PORT_ID == 3)
#define SPI2_MISO      1
#define SPI2_MISO_PORT I
#define SPI2_MISO_PIN  GPIO_PIN_2
#elif (SPI2_MISO_PORT_ID == 4)
#define SPI2_MISO      1
#define SPI2_MISO_PORT A
#define SPI2_MISO_PIN  GPIO_PIN_12
#else
#error "Invalid SPI2_MISO Pin Configuration!"
#endif

//   <o> SPI2_MOSI Pin <0=>Not Used <1=>PB15 <2=>PC3 <3=>PI3 <4=>PA10
#define SPI2_MOSI_PORT_ID 0
#if (SPI2_MOSI_PORT_ID == 0)
#define SPI2_MOSI 0
#elif (SPI2_MOSI_PORT_ID == 1)
#define SPI2_MOSI      1
#define SPI2_MOSI_PORT B
#define SPI2_MOSI_PIN  GPIO_PIN_15
#elif (SPI2_MOSI_PORT_ID == 2)
#define SPI2_MOSI      1
#define SPI2_MOSI_PORT C
#define SPI2_MOSI_PIN  GPIO_PIN_3
#elif (SPI2_MOSI_PORT_ID == 3)
#define SPI2_MOSI      1
#define SPI2_MOSI_PORT I
#define SPI2_MOSI_PIN  GPIO_PIN_3
#elif (SPI2_MOSI_PORT_ID == 4)
#define SPI2_MOSI      1
#define SPI2_MOSI_PORT A
#define SPI2_MOSI_PIN  GPIO_PIN_10
#else
#error "Invalid SPI2_MOSI Pin Configuration!"
#endif

//   <o> SPI2_SCK Pin <0=>PB10 <1=>PB13 <2=>PC7 <3=>PD3 <4=>PI1 <5=>PA9
#define SPI2_SCK_PORT_ID 1
#if (SPI2_SCK_PORT_ID == 0)
#define SPI2_SCK_PORT B
#define SPI2_SCK_PIN  GPIO_PIN_10
#elif (SPI2_SCK_PORT_ID == 1)
#define SPI2_SCK_PORT B
#define SPI2_SCK_PIN  GPIO_PIN_13
#elif (SPI2_SCK_PORT_ID == 2)
#define SPI2_SCK_PORT C
#define SPI2_SCK_PIN  GPIO_PIN_7
#elif (SPI2_SCK_PORT_ID == 3)
#define SPI2_SCK_PORT D
#define SPI2_SCK_PIN  GPIO_PIN_3
#elif (SPI2_SCK_PORT_ID == 4)
#define SPI2_SCK_PORT I
#define SPI2_SCK_PIN  GPIO_PIN_1
#elif (SPI2_SCK_PORT_ID == 5)
#define SPI2_SCK_PORT A
#define SPI2_SCK_PIN  GPIO_PIN_9
#else
#error "Invalid SPI2_SCK Pin Configuration!"
#endif

//   <o> SPI2_NSS Pin <0=>Not Used <1=>PB9 <2=>PB12 <3=>PI0 <4=>PA11
#define SPI2_NSS_PORT_ID 0
#if (SPI2_NSS_PORT_ID == 0)
#define SPI2_NSS 0
#elif (SPI2_NSS_PORT_ID == 1)
#define SPI2_NSS      1
#define SPI2_NSS_PORT B
#define SPI2_NSS_PIN  GPIO_PIN_9
#elif (SPI2_NSS_PORT_ID == 2)
#define SPI2_NSS      1
#define SPI2_NSS_PORT B
#define SPI2_NSS_PIN  GPIO_PIN_12
#elif (SPI2_NSS_PORT_ID == 3)
#define SPI2_NSS      1
#define SPI2_NSS_PORT I
#define SPI2_NSS_PIN  GPIO_PIN_0
#elif (SPI2_NSS_PORT_ID == 4)
#define SPI2_NSS      1
#define SPI2_NSS_PORT A
#define SPI2_NSS_PIN  GPIO_PIN_11
#else
#error "Invalid SPI2_NSS Pin Configuration!"
#endif

//   <e> SPI2 Interrupt
//   <i> Must be enabled when using DMA.
#define SPI2_IT_ENABLE          0
//     <o> SPI2 Interrupt Priority <0-15>
//     <i> The Interrupt Priority of SPI2
#define SPI2_IT_PRIORITY        2
//     <o> SPI2 Interrupt SubPriority <0-15>
//     <i> The Interrupt SubPriority of SPI2
#define SPI2_IT_SUB             3
//   </e>

//   <e> DMA Rx
//     <o1> Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <3=>3
//     <i>  Selects DMA Stream (only Stream 3 can be used)
//     <o3> Channel <0=>0
//     <i>  Selects DMA Channel (only Channel 0 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//     <o5> DMA Rx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Rx
//     <o6> DMA Rx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Rx
//   </e>
#define SPI2_RX_DMA             0
#define SPI2_RX_DMA_NUMBER      1
#define SPI2_RX_DMA_STREAM      3
#define SPI2_RX_DMA_CHANNEL     0
#define SPI2_RX_DMA_PRIORITY    0
#define SPI2_RX_DMA_IT_PRIORITY 2
#define SPI2_RX_DMA_IT_SUB      4

//   <e> DMA Tx
//     <o1> Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <4=>4
//     <i>  Selects DMA Stream (only Stream 4 can be used)
//     <o3> Channel <0=>0
//     <i>  Selects DMA Channel (only Channel 0 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//     <o5> DMA Tx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Tx
//     <o6> DMA Tx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Tx
//   </e>
#define SPI2_TX_DMA             0
#define SPI2_TX_DMA_NUMBER      1
#define SPI2_TX_DMA_STREAM      4
#define SPI2_TX_DMA_CHANNEL     0
#define SPI2_TX_DMA_PRIORITY    0
#define SPI2_TX_DMA_IT_PRIORITY 2
#define SPI2_TX_DMA_IT_SUB      2

// </e>

// <e> SPI3 (Serial Peripheral Interface 3)
#define SPI3_ENABLE             0

//   <o> SPI3_MISO Pin <0=>Not Used <1=>PB4 <2=>PC11
#define SPI3_MISO_PORT_ID       0
#if (SPI3_MISO_PORT_ID == 0)
#define SPI3_MISO 0
#elif (SPI3_MISO_PORT_ID == 1)
#define SPI3_MISO      1
#define SPI3_MISO_PORT B
#define SPI3_MISO_PIN  GPIO_PIN_4
#elif (SPI3_MISO_PORT_ID == 2)
#define SPI3_MISO      1
#define SPI3_MISO_PORT C
#define SPI3_MISO_PIN  GPIO_PIN_11
#else
#error "Invalid SPI3_MISO Pin Configuration!"
#endif

//   <o> SPI3_MOSI Pin <0=>Not Used <1=>PB5 <2=>PC12 <3=>PD6
#define SPI3_MOSI_PORT_ID 0
#if (SPI3_MOSI_PORT_ID == 0)
#define SPI3_MOSI 0
#elif (SPI3_MOSI_PORT_ID == 1)
#define SPI3_MOSI      1
#define SPI3_MOSI_PORT B
#define SPI3_MOSI_PIN  GPIO_PIN_5
#elif (SPI3_MOSI_PORT_ID == 2)
#define SPI3_MOSI      1
#define SPI3_MOSI_PORT C
#define SPI3_MOSI_PIN  GPIO_PIN_12
#elif (SPI3_MOSI_PORT_ID == 3)
#define SPI3_MOSI      1
#define SPI3_MOSI_PORT D
#define SPI3_MOSI_PIN  GPIO_PIN_6
#else
#error "Invalid SPI3_MOSI Pin Configuration!"
#endif

//   <o> SPI3_SCK Pin <0=>PB3 <1=>PB12 <2=>PC10
#define SPI3_SCK_PORT_ID 0
#if (SPI3_SCK_PORT_ID == 0)
#define SPI3_SCK_PORT B
#define SPI3_SCK_PIN  GPIO_PIN_3
#elif (SPI3_SCK_PORT_ID == 1)
#define SPI3_SCK_PORT B
#define SPI3_SCK_PIN  GPIO_PIN_12
#elif (SPI3_SCK_PORT_ID == 2)
#define SPI3_SCK_PORT C
#define SPI3_SCK_PIN  GPIO_PIN_10
#else
#error "Invalid SPI3_SCK Pin Configuration!"
#endif

//   <o> SPI3_NSS Pin <0=>Not Used <1=>PA4 <2=>PA15
#define SPI3_NSS_PORT_ID 0
#if (SPI3_NSS_PORT_ID == 0)
#define SPI3_NSS 0
#elif (SPI3_NSS_PORT_ID == 1)
#define SPI3_NSS      1
#define SPI3_NSS_PORT A
#define SPI3_NSS_PIN  GPIO_PIN_4
#elif (SPI3_NSS_PORT_ID == 2)
#define SPI3_NSS      1
#define SPI3_NSS_PORT A
#define SPI3_NSS_PIN  GPIO_PIN_15
#else
#error "Invalid SPI3_NSS Pin Configuration!"
#endif

//   <e> SPI3 Interrupt
//   <i> Must be enabled when using DMA.
#define SPI3_IT_ENABLE          0
//     <o> SPI3 Interrupt Priority <0-15>
//     <i> The Interrupt Priority of SPI3
#define SPI3_IT_PRIORITY        2
//     <o> SPI3 Interrupt SubPriority <0-15>
//     <i> The Interrupt SubPriority of SPI3
#define SPI3_IT_SUB             3
//   </e>

