Deadline039/STM32F4xx-HAL-CSP/Config/CSP_Config.h
//   <e> DMA Rx
//     <o1> Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <0=>0 <2=>2
//     <i>  Selects DMA Stream (only Stream 0 or 2 can be used)
//     <o3> Channel <0=>0
//     <i>  Selects DMA Channel (only Channel 0 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//     <o5> DMA Rx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Rx
//     <o6> DMA Rx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Rx
//   </e>
#define SPI3_RX_DMA             0
#define SPI3_RX_DMA_NUMBER      1
#define SPI3_RX_DMA_STREAM      0
#define SPI3_RX_DMA_CHANNEL     0
#define SPI3_RX_DMA_PRIORITY    0
#define SPI3_RX_DMA_IT_PRIORITY 2
#define SPI3_RX_DMA_IT_SUB      4

//   <e> DMA Tx
//     <o1> Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <5=>5 <7=>7
//     <i>  Selects DMA Stream (only Stream 5 or 7 can be used)
//     <o3> Channel <0=>0
//     <i>  Selects DMA Channel (only Channel 0 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//     <o5> DMA Tx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Tx
//     <o6> DMA Tx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Tx
//   </e>
#define SPI3_TX_DMA             0
#define SPI3_TX_DMA_NUMBER      1
#define SPI3_TX_DMA_STREAM      5
#define SPI3_TX_DMA_CHANNEL     0
#define SPI3_TX_DMA_PRIORITY    0
#define SPI3_TX_DMA_IT_PRIORITY 2
#define SPI3_TX_DMA_IT_SUB      2

// </e>

// <e> SPI4 (Serial Peripheral Interface 4)
#define SPI4_ENABLE             0

//   <o> SPI4_MISO Pin <0=>Not Used <1=>PA11 <2=>PE5 <3=>PE13
#define SPI4_MISO_PORT_ID       0
#if (SPI4_MISO_PORT_ID == 0)
#define SPI4_MISO 0
#elif (SPI4_MISO_PORT_ID == 1)
#define SPI4_MISO      1
#define SPI4_MISO_PORT A
#define SPI4_MISO_PIN  GPIO_PIN_11
#elif (SPI4_MISO_PORT_ID == 2)
#define SPI4_MISO      1
#define SPI4_MISO_PORT E
#define SPI4_MISO_PIN  GPIO_PIN_5
#elif (SPI4_MISO_PORT_ID == 3)
#define SPI4_MISO      1
#define SPI4_MISO_PORT E
#define SPI4_MISO_PIN  GPIO_PIN_13
#else
#error "Invalid SPI4_MISO Pin Configuration!"
#endif

//   <o> SPI4_MOSI Pin <0=>Not Used <1=>PA1 <2=>PE6 <3=>PE14
#define SPI4_MOSI_PORT_ID 0
#if (SPI4_MOSI_PORT_ID == 0)
#define SPI4_MOSI 0
#elif (SPI4_MOSI_PORT_ID == 1)
#define SPI4_MOSI      1
#define SPI4_MOSI_PORT A
#define SPI4_MOSI_PIN  GPIO_PIN_1
#elif (SPI4_MOSI_PORT_ID == 2)
#define SPI4_MOSI      1
#define SPI4_MOSI_PORT E
#define SPI4_MOSI_PIN  GPIO_PIN_6
#elif (SPI4_MOSI_PORT_ID == 3)
#define SPI4_MOSI      1
#define SPI4_MOSI_PORT E
#define SPI4_MOSI_PIN  GPIO_PIN_14
#else
#error "Invalid SPI4_MOSI Pin Configuration!"
#endif

//   <o> SPI4_SCK Pin <0=>PB13 <1=>PE2 <2=>PE12
#define SPI4_SCK_PORT_ID 0
#if (SPI4_SCK_PORT_ID == 0)
#define SPI4_SCK_PORT B
#define SPI4_SCK_PIN  GPIO_PIN_13
#elif (SPI4_SCK_PORT_ID == 1)
#define SPI4_SCK_PORT E
#define SPI4_SCK_PIN  GPIO_PIN_2
#elif (SPI4_SCK_PORT_ID == 2)
#define SPI4_SCK_PORT E
#define SPI4_SCK_PIN  GPIO_PIN_12
#else
#error "Invalid SPI4_SCK Pin Configuration!"
#endif

//   <o> SPI4_NSS Pin <0=>Not Used <1=>PB12 <2=>PE4 <3=>PE11
#define SPI4_NSS_PORT_ID 0
#if (SPI4_NSS_PORT_ID == 0)
#define SPI4_NSS 0
#elif (SPI4_NSS_PORT_ID == 1)
#define SPI4_NSS      1
#define SPI4_NSS_PORT B
#define SPI4_NSS_PIN  GPIO_PIN_12
#elif (SPI4_NSS_PORT_ID == 2)
#define SPI4_NSS      1
#define SPI4_NSS_PORT E
#define SPI4_NSS_PIN  GPIO_PIN_4
#elif (SPI4_NSS_PORT_ID == 3)
#define SPI4_NSS      1
#define SPI4_NSS_PORT E
#define SPI4_NSS_PIN  GPIO_PIN_11
#else
#error "Invalid SPI4_NSS Pin Configuration!"
#endif

//   <e> SPI4 Interrupt
//   <i> Must be enabled when using DMA.
#define SPI4_IT_ENABLE          0
//     <o> SPI4 Interrupt Priority <0-15>
//     <i> The Interrupt Priority of SPI4
#define SPI4_IT_PRIORITY        2
//     <o> SPI4 Interrupt SubPriority <0-15>
//     <i> The Interrupt SubPriority of SPI4
#define SPI4_IT_SUB             3
//   </e>

//   <e> DMA Rx
//     <o1> Number <2=>2
//     <i>  Selects DMA Number (only DMA2 can be used)
//     <o2> Stream <0=>0 <3=>3 <4=>4
//     <i>  Selects DMA Stream (only Stream 0 or 3 can be used)
//     <o3> Channel <4=>4 <5=>5
//     <i>  Selects DMA Channel (only Channel 4 or 5 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//     <o5> DMA Rx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Rx
//     <o6> DMA Rx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Rx
//   </e>
#define SPI4_RX_DMA             0
#define SPI4_RX_DMA_NUMBER      1
#define SPI4_RX_DMA_STREAM      0
#define SPI4_RX_DMA_CHANNEL     0
#define SPI4_RX_DMA_PRIORITY    0
#define SPI4_RX_DMA_IT_PRIORITY 2
#define SPI4_RX_DMA_IT_SUB      4

//   <e> DMA Tx
//     <o1> Number <2=>2
//     <i>  Selects DMA Number (only DMA2 can be used)
//     <o2> Stream <1=>1 <4=>4
//     <i>  Selects DMA Stream (only Stream 1 or 4 can be used)
//     <o3> Channel <4=>4 <5=>5
//     <i>  Selects DMA Channel (only Channel 4 or 5 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//     <o5> DMA Tx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Tx
//     <o6> DMA Tx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Tx
//   </e>
#define SPI4_TX_DMA             0
#define SPI4_TX_DMA_NUMBER      1
#define SPI4_TX_DMA_STREAM      5
#define SPI4_TX_DMA_CHANNEL     0
#define SPI4_TX_DMA_PRIORITY    0
#define SPI4_TX_DMA_IT_PRIORITY 2
#define SPI4_TX_DMA_IT_SUB      2

// </e>

// <e> SPI5 (Serial Peripheral Interface 5)
#define SPI5_ENABLE             0

//   <o> SPI5_MISO Pin <0=>Not Used <1=>PA12 <2=>PE5 <3=>PE13 <4=>PF8 <5=>PH7
#define SPI5_MISO_PORT_ID       0
#if (SPI5_MISO_PORT_ID == 0)
#define SPI5_MISO 0
#elif (SPI5_MISO_PORT_ID == 1)
#define SPI5_MISO      1
#define SPI5_MISO_PORT A
#define SPI5_MISO_PIN  GPIO_PIN_12
#elif (SPI5_MISO_PORT_ID == 2)
#define SPI5_MISO      1
#define SPI5_MISO_PORT E
#define SPI5_MISO_PIN  GPIO_PIN_5
#elif (SPI5_MISO_PORT_ID == 3)
#define SPI5_MISO      1
#define SPI5_MISO_PORT E
#define SPI5_MISO_PIN  GPIO_PIN_13
#elif (SPI5_MISO_PORT_ID == 4)
#define SPI5_MISO      1
#define SPI5_MISO_PORT F
#define SPI5_MISO_PIN  GPIO_PIN_8
#elif (SPI5_MISO_PORT_ID == 5)
#define SPI5_MISO      1
#define SPI5_MISO_PORT H
#define SPI5_MISO_PIN  GPIO_PIN_7
#else
#error "Invalid SPI5_MISO Pin Configuration!"
#endif

//   <o> SPI5_MOSI Pin <0=>Not Used <1=>PA10 <2=>PB8 <3=>PE6 <4=>PE14 <5=>PF9
//   <6=>PF11
#define SPI5_MOSI_PORT_ID 0
#if (SPI5_MOSI_PORT_ID == 0)
#define SPI5_MOSI 0
#elif (SPI5_MOSI_PORT_ID == 1)
#define SPI5_MOSI      1
#define SPI5_MOSI_PORT A
#define SPI5_MOSI_PIN  GPIO_PIN_10
#elif (SPI5_MOSI_PORT_ID == 2)
#define SPI5_MOSI      1
#define SPI5_MOSI_PORT B
#define SPI5_MOSI_PIN  GPIO_PIN_8
#elif (SPI5_MOSI_PORT_ID == 3)
#define SPI5_MOSI      1
#define SPI5_MOSI_PORT E
#define SPI5_MOSI_PIN  GPIO_PIN_6
#elif (SPI5_MOSI_PORT_ID == 4)
#define SPI5_MOSI      1
#define SPI5_MOSI_PORT E
#define SPI5_MOSI_PIN  GPIO_PIN_14
#elif (SPI5_MOSI_PORT_ID == 5)
#define SPI5_MOSI      1
#define SPI5_MOSI_PORT F
#define SPI5_MOSI_PIN  GPIO_PIN_9
#elif (SPI5_MOSI_PORT_ID == 6)
#define SPI5_MOSI      1
#define SPI5_MOSI_PORT F
#define SPI5_MOSI_PIN  GPIO_PIN_11
#else
#error "Invalid SPI5_MOSI Pin Configuration!"
#endif

//   <o> SPI5_SCK Pin <0=>PB0 <1=>PE2 <2=>PE12 <3=>PF7 <4=>PH6
#define SPI5_SCK_PORT_ID 3
#if (SPI5_SCK_PORT_ID == 0)
#define SPI5_SCK_PORT B
#define SPI5_SCK_PIN  GPIO_PIN_0
#elif (SPI5_SCK_PORT_ID == 1)
#define SPI5_SCK_PORT E
#define SPI5_SCK_PIN  GPIO_PIN_2
#elif (SPI5_SCK_PORT_ID == 2)
#define SPI5_SCK_PORT E
#define SPI5_SCK_PIN  GPIO_PIN_12
#elif (SPI5_SCK_PORT_ID == 3)
#define SPI5_SCK_PORT F
#define SPI5_SCK_PIN  GPIO_PIN_7
#elif (SPI5_SCK_PORT_ID == 4)
#define SPI5_SCK_PORT H
#define SPI5_SCK_PIN  GPIO_PIN_6
#else
#error "Invalid SPI5_SCK Pin Configuration!"
#endif

//   <o> SPI5_NSS Pin <0=>Not Used <1=>PB1 <2=>PE4 <3=>PE11 <4=>PF6 <5=>PH5
#define SPI5_NSS_PORT_ID 0
#if (SPI5_NSS_PORT_ID == 0)
#define SPI5_NSS 0
#elif (SPI5_NSS_PORT_ID == 1)
#define SPI5_NSS      1
#define SPI5_NSS_PORT B
#define SPI5_NSS_PIN  GPIO_PIN_1
#elif (SPI5_NSS_PORT_ID == 2)
#define SPI5_NSS      1
#define SPI5_NSS_PORT E
#define SPI5_NSS_PIN  GPIO_PIN_4
#elif (SPI5_NSS_PORT_ID == 3)
#define SPI5_NSS      1
#define SPI5_NSS_PORT E
#define SPI5_NSS_PIN  GPIO_PIN_11
#elif (SPI5_NSS_PORT_ID == 4)
#define SPI5_NSS      1
#define SPI5_NSS_PORT F
#define SPI5_NSS_PIN  GPIO_PIN_6
#elif (SPI5_NSS_PORT_ID == 5)
#define SPI5_NSS      1
#define SPI5_NSS_PORT H
#define SPI5_NSS_PIN  GPIO_PIN_5
#else
#error "Invalid SPI5_NSS Pin Configuration!"
#endif

//   <e> SPI5 Interrupt
//   <i> Must be enabled when using DMA.
#define SPI5_IT_ENABLE          0
//     <o> SPI5 Interrupt Priority <0-15>
//     <i> The Interrupt Priority of SPI5
#define SPI5_IT_PRIORITY        2
//     <o> SPI5 Interrupt SubPriority <0-15>
//     <i> The Interrupt SubPriority of SPI5
#define SPI5_IT_SUB             3
//   </e>

