Deadline039/STM32F4xx-HAL-CSP/Config/CSP_Config.h
//   <e> DMA Rx
//     <o1> Number <2=>2
//     <i>  Selects DMA Number (only DMA2 can be used)
//     <o2> Stream <3=>3 <5=>5
//     <i>  Selects DMA Stream (only Stream 3 or 5 can be used)
//     <o3> Channel <2=>2 <7=>7
//     <i>  Selects DMA Channel (only Channel 2 or 7 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//     <o5> DMA Rx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Rx
//     <o6> DMA Rx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Rx
//   </e>
#define SPI5_RX_DMA             0
#define SPI5_RX_DMA_NUMBER      2
#define SPI5_RX_DMA_STREAM      3
#define SPI5_RX_DMA_CHANNEL     2
#define SPI5_RX_DMA_PRIORITY    0
#define SPI5_RX_DMA_IT_PRIORITY 2
#define SPI5_RX_DMA_IT_SUB      4

//   <e> DMA Tx
//     <o1> Number <2=>2
//     <i>  Selects DMA Number (only DMA2 can be used)
//     <o2> Stream <4=>4 <5=>5 <6=>6
//     <i>  Selects DMA Stream (only Stream 4 or 6 can be used)
//     <o3> Channel <2=>2 <5=>5 <7=>7
//     <i>  Selects DMA Channel (only Channel 2 or 7 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//     <o5> DMA Tx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Tx
//     <o6> DMA Tx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Tx
//   </e>
#define SPI5_TX_DMA             0
#define SPI5_TX_DMA_NUMBER      2
#define SPI5_TX_DMA_STREAM      4
#define SPI5_TX_DMA_CHANNEL     2
#define SPI5_TX_DMA_PRIORITY    0
#define SPI5_TX_DMA_IT_PRIORITY 2
#define SPI5_TX_DMA_IT_SUB      2

// </e>

// <e> SPI6 (Serial Peripheral Interface 6)
#define SPI6_ENABLE             0

//   <o> SPI6_MISO Pin <0=>Not Used <1=>PG12
#define SPI6_MISO_PORT_ID       0
#if (SPI6_MISO_PORT_ID == 0)
#define SPI6_MISO 0
#elif (SPI6_MISO_PORT_ID == 1)
#define SPI6_MISO      1
#define SPI6_MISO_PORT G
#define SPI6_MISO_PIN  GPIO_PIN_12
#else
#error "Invalid SPI6_MISO Pin Configuration!"
#endif

//   <o> SPI6_MOSI Pin <0=>Not Used <1=>PG14
#define SPI6_MOSI_PORT_ID 0
#if (SPI6_MOSI_PORT_ID == 0)
#define SPI6_MOSI 0
#elif (SPI6_MOSI_PORT_ID == 1)
#define SPI6_MOSI      1
#define SPI6_MOSI_PORT G
#define SPI6_MOSI_PIN  GPIO_PIN_14
#else
#error "Invalid SPI6_MOSI Pin Configuration!"
#endif

//   <o> SPI6_SCK Pin <0=>PG13
#define SPI6_SCK_PORT_ID 0
#if (SPI6_SCK_PORT_ID == 0)
#define SPI6_SCK_PORT G
#define SPI6_SCK_PIN  GPIO_PIN_13
#else
#error "Invalid SPI6_SCK Pin Configuration!"
#endif

//   <o> SPI6_NSS Pin <0=>Not Used <1=>PG8
#define SPI6_NSS_PORT_ID 0
#if (SPI6_NSS_PORT_ID == 0)
#define SPI6_NSS 0
#elif (SPI6_NSS_PORT_ID == 1)
#define SPI6_NSS      1
#define SPI6_NSS_PORT G
#define SPI6_NSS_PIN  GPIO_PIN_8
#else
#error "Invalid SPI6_NSS Pin Configuration!"
#endif

//   <e> SPI6 Interrupt
//   <i> Must be enabled when using DMA.
#define SPI6_IT_ENABLE          0
//     <o> SPI6 Interrupt Priority <0-15>
//     <i> The Interrupt Priority of SPI6
#define SPI6_IT_PRIORITY        2
//     <o> SPI6 Interrupt SubPriority <0-15>
//     <i> The Interrupt SubPriority of SPI6
#define SPI6_IT_SUB             3
//   </e>

//   <e> DMA Rx
//     <o1> Number <2=>2
//     <i>  Selects DMA Number (only DMA2 can be used)
//     <o2> Stream <6=>6
//     <i>  Selects DMA Stream (only Stream 6 can be used)
//     <o3> Channel <1=>1
//     <i>  Selects DMA Channel (only Channel 1 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//     <o5> DMA Rx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Rx
//     <o6> DMA Rx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Rx
//   </e>
#define SPI6_RX_DMA             0
#define SPI6_RX_DMA_NUMBER      2
#define SPI6_RX_DMA_STREAM      6
#define SPI6_RX_DMA_CHANNEL     1
#define SPI6_RX_DMA_PRIORITY    0
#define SPI6_RX_DMA_IT_PRIORITY 2
#define SPI6_RX_DMA_IT_SUB      4

//   <e> DMA Tx
//     <o1> Number <2=>2
//     <i>  Selects DMA Number (only DMA2 can be used)
//     <o2> Stream <5=>5
//     <i>  Selects DMA Stream (only Stream 5 can be used)
//     <o3> Channel <1=>1
//     <i>  Selects DMA Channel (only Channel 1 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//     <o5> DMA Tx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Tx
//     <o6> DMA Tx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Tx
//   </e>
#define SPI6_TX_DMA             0
#define SPI6_TX_DMA_NUMBER      2
#define SPI6_TX_DMA_STREAM      5
#define SPI6_TX_DMA_CHANNEL     1
#define SPI6_TX_DMA_PRIORITY    0
#define SPI6_TX_DMA_IT_PRIORITY 2
#define SPI6_TX_DMA_IT_SUB      2

// </e>

// <e> CAN1 (Controller Area Network 1)
#define CAN1_ENABLE             0

//   <o> CAN1_RX Pin <0=>PA11 <1=>PB8 <2=>PD0 <3=>PI9 <4=>PG0
#define CAN1_RX_PORT_ID         0
#if (CAN1_RX_PORT_ID == 0)
#define CAN1_RX_PORT A
#define CAN1_RX_PIN  GPIO_PIN_11
#elif (CAN1_RX_PORT_ID == 1)
#define CAN1_RX_PORT B
#define CAN1_RX_PIN  GPIO_PIN_8
#elif (CAN1_RX_PORT_ID == 2)
#define CAN1_RX_PORT D
#define CAN1_RX_PIN  GPIO_PIN_0
#elif (CAN1_RX_PORT_ID == 3)
#define CAN1_RX_PORT I
#define CAN1_RX_PIN  GPIO_PIN_9
#elif (CAN1_RX_PORT_ID == 4)
#define CAN1_RX_PORT G
#define CAN1_RX_PIN  GPIO_PIN_0
#else
#error "Invalid CAN1_RX Pin Configuration!"
#endif

//   <o> CAN1_TX Pin <0=>PA12 <1=>PB9 <2=>PD1 <3=>PH13 <4=>PG1
#define CAN1_TX_PORT_ID 0
#if (CAN1_TX_PORT_ID == 0)
#define CAN1_TX_PORT A
#define CAN1_TX_PIN  GPIO_PIN_12
#elif (CAN1_TX_PORT_ID == 1)
#define CAN1_TX_PORT B
#define CAN1_TX_PIN  GPIO_PIN_9
#elif (CAN1_TX_PORT_ID == 2)
#define CAN1_TX_PORT D
#define CAN1_TX_PIN  GPIO_PIN_1
#elif (CAN1_TX_PORT_ID == 3)
#define CAN1_TX_PORT H
#define CAN1_TX_PIN  GPIO_PIN_13
#elif (CAN1_TX_PORT_ID == 4)
#define CAN1_TX_PORT G
#define CAN1_TX_PIN  GPIO_PIN_1
#else
#error "Invalid CAN1_TX Pin Configuration!"
#endif

//   <e> Enable CAN Transmit Interrupt
#define CAN1_ENABLE_TX_IT    0
//     <o> CAN Transmit Interrupt Priority <0-15>
//     <i> The Interrupt Priority of CAN Transmit
#define CAN1_TX_IT_PRIORITY  2
//     <o> CAN Transmit Interrupt SubPriority <0-15>
//     <i> The Interrupt SubPriority of CAN Transmit
#define CAN1_TX_IT_SUB       3
//   </e>

//   <e> Enable CAN Receive FIFO0 Interrupt
#define CAN1_ENABLE_RX0_IT   0
//     <o> CAN Receive FIFO0 Interrupt Priority <0-15>
//     <i> The Interrupt Priority of CAN Receive FIFO0
#define CAN1_RX0_IT_PRIORITY 2
//     <o> CAN Receive FIFO0 Interrupt SubPriority <0-15>
//     <i> The Interrupt SubPriority of CAN Receive FIFO0
#define CAN1_RX0_IT_SUB      3
//   </e>

//   <e> Enable CAN Receive FIFO1 Interrupt
#define CAN1_ENABLE_RX1_IT   0
//     <o> CAN Receive FIFO1 Interrupt Priority <0-15>
//     <i> The Interrupt Priority of CAN Receive FIFO1
#define CAN1_RX1_IT_PRIORITY 2
//     <o> CAN Receive FIFO1 Interrupt SubPriority <0-15>
//     <i> The Interrupt SubPriority of CAN Receive FIFO1
#define CAN1_RX1_IT_SUB      3
//   </e>

//   <e> Enable CAN Stauts Change or Error (SCE) Interrupt
#define CAN1_ENABLE_SCE_IT   0
//     <o> CAN SCE Interrupt Priority <0-15>
//     <i> The Interrupt Priority of CAN Receive FIFO0
#define CAN1_SCE_IT_PRIORITY 2
//     <o> CAN SCE Interrupt SubPriority <0-15>
//     <i> The Interrupt SubPriority of CAN Receive FIFO0
#define CAN1_SCE_IT_SUB      3
//   </e>

// </e>

// <e> CAN2 (Controller Area Network 2)
#define CAN2_ENABLE          0

//   <o> CAN2_RX Pin <0=>PB5 <1=>PB12 <2=>PG11
#define CAN2_RX_PORT_ID      0
#if (CAN2_RX_PORT_ID == 0)
#define CAN2_RX_PORT B
#define CAN2_RX_PIN  GPIO_PIN_5
#elif (CAN2_RX_PORT_ID == 1)
#define CAN2_RX_PORT B
#define CAN2_RX_PIN  GPIO_PIN_12
#elif (CAN2_RX_PORT_ID == 2)
#define CAN2_RX_PORT G
#define CAN2_RX_PIN  GPIO_PIN_11
#else
#error "Invalid CAN2_RX Pin Configuration!"
#endif

//   <o> CAN2_TX Pin <0=>PB6 <1=>PB13 <2=>PG12
#define CAN2_TX_PORT_ID 0
#if (CAN2_TX_PORT_ID == 0)
#define CAN2_TX_PORT B
#define CAN2_TX_PIN  GPIO_PIN_6
#elif (CAN2_TX_PORT_ID == 1)
#define CAN2_TX_PORT B
#define CAN2_TX_PIN  GPIO_PIN_13
#elif (CAN2_TX_PORT_ID == 2)
#define CAN2_TX_PORT G
#define CAN2_TX_PIN  GPIO_PIN_12
#else
#error "Invalid CAN2_TX Pin Configuration!"
#endif

//   <e> Enable CAN Transmit Interrupt
#define CAN2_ENABLE_TX_IT    0
//     <o> CAN Transmit Interrupt Priority <0-15>
//     <i> The Interrupt Priority of CAN Transmit
#define CAN2_TX_IT_PRIORITY  2
//     <o> CAN Transmit Interrupt SubPriority <0-15>
//     <i> The Interrupt SubPriority of CAN Transmit
#define CAN2_TX_IT_SUB       3
//   </e>

//   <e> Enable CAN Receive FIFO0 Interrupt
#define CAN2_ENABLE_RX0_IT   0
//     <o> CAN Receive FIFO0 Interrupt Priority <0-15>
//     <i> The Interrupt Priority of CAN Receive FIFO0
#define CAN2_RX0_IT_PRIORITY 2
//     <o> CAN Receive FIFO0 Interrupt SubPriority <0-15>
//     <i> The Interrupt SubPriority of CAN Receive FIFO0
#define CAN2_RX0_IT_SUB      3
//   </e>

//   <e> Enable CAN Receive FIFO1 Interrupt
#define CAN2_ENABLE_RX1_IT   0
//     <o> CAN Receive FIFO1 Interrupt Priority <0-15>
//     <i> The Interrupt Priority of CAN Receive FIFO1
#define CAN2_RX1_IT_PRIORITY 2
//     <o> CAN Receive FIFO1 Interrupt SubPriority <0-15>
//     <i> The Interrupt SubPriority of CAN Receive FIFO1
#define CAN2_RX1_IT_SUB      3
//   </e>

//   <e> Enable CAN Stauts Change or Error (SCE) Interrupt
#define CAN2_ENABLE_SCE_IT   0
//     <o> CAN SCE Interrupt Priority <0-15>
//     <i> The Interrupt Priority of CAN Receive FIFO0
#define CAN2_SCE_IT_PRIORITY 2
//     <o> CAN SCE Interrupt SubPriority <0-15>
//     <i> The Interrupt SubPriority of CAN Receive FIFO0
#define CAN2_SCE_IT_SUB      3
//   </e>

// </e>

// <e> CAN3 (Controller Area Network 3)
// <i> Available only on STM32F413xx and STM32F423xx device series
#define CAN3_ENABLE          0

//   <o> CAN3_RX Pin <0=>PA8 <1=>PB3
#define CAN3_RX_PORT_ID      0
#if (CAN3_RX_PORT_ID == 0)
#define CAN3_RX_PORT A
#define CAN3_RX_PIN  GPIO_PIN_8
#elif (CAN3_RX_PORT_ID == 1)
#define CAN3_RX_PORT B
#define CAN3_RX_PIN  GPIO_PIN_3
#else
#error "Invalid CAN3_RX Pin Configuration!"
#endif

//   <o> CAN3_TX Pin <0=>PA15 <1=>PB4
#define CAN3_TX_PORT_ID 0
#if (CAN3_TX_PORT_ID == 0)
#define CAN3_TX_PORT A
#define CAN3_TX_PIN  GPIO_PIN_15
#elif (CAN3_TX_PORT_ID == 1)
#define CAN3_TX_PORT B
#define CAN3_TX_PIN  GPIO_PIN_4
#else
#error "Invalid CAN3_TX Pin Configuration!"
#endif

//   <e> Enable CAN Transmit Interrupt
#define CAN3_ENABLE_TX_IT    0
//     <o> CAN Transmit Interrupt Priority <0-15>
//     <i> The Interrupt Priority of CAN Transmit
#define CAN3_TX_IT_PRIORITY  2
//     <o> CAN Transmit Interrupt SubPriority <0-15>
//     <i> The Interrupt SubPriority of CAN Transmit
#define CAN3_TX_IT_SUB       3
//   </e>

//   <e> Enable CAN Receive FIFO0 Interrupt
#define CAN3_ENABLE_RX0_IT   0
//     <o> CAN Receive FIFO0 Interrupt Priority <0-15>
//     <i> The Interrupt Priority of CAN Receive FIFO0
#define CAN3_RX0_IT_PRIORITY 2
//     <o> CAN Receive FIFO0 Interrupt SubPriority <0-15>
//     <i> The Interrupt SubPriority of CAN Receive FIFO0
#define CAN3_RX0_IT_SUB      3
//   </e>

//   <e> Enable CAN Receive FIFO1 Interrupt
#define CAN3_ENABLE_RX1_IT   0
//     <o> CAN Receive FIFO1 Interrupt Priority <0-15>
//     <i> The Interrupt Priority of CAN Receive FIFO1
#define CAN3_RX1_IT_PRIORITY 2
//     <o> CAN Receive FIFO1 Interrupt SubPriority <0-15>
//     <i> The Interrupt SubPriority of CAN Receive FIFO1
#define CAN3_RX1_IT_SUB      3
//   </e>

//   <e> Enable CAN Stauts Change or Error (SCE) Interrupt
#define CAN3_ENABLE_SCE_IT   0
//     <o> CAN SCE Interrupt Priority <0-15>
//     <i> The Interrupt Priority of CAN Receive FIFO0
#define CAN3_SCE_IT_PRIORITY 2
//     <o> CAN SCE Interrupt SubPriority <0-15>
//     <i> The Interrupt SubPriority of CAN Receive FIFO0
#define CAN3_SCE_IT_SUB      3
//   </e>

// </e>

// <<< end of configuration section >>>

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* Enable and disable the clock of GPIO. */
#define _CSP_GPIO_PORT(x)          GPIO##x
#define CSP_GPIO_PORT(x)           _CSP_GPIO_PORT(x)
#define _CSP_GPIO_CLK_ENABLE(x)    __HAL_RCC_GPIO##x##_CLK_ENABLE()
#define CSP_GPIO_CLK_ENABLE(x)     _CSP_GPIO_CLK_ENABLE(x)

