Deadline039/STM32F4xx-HAL-CSP/Config/CSP_Config.h
/* Pasting the DMA Stream. */
#define _CSP_DMA_STREAM(x, y)      DMA##x##_Stream##y
#define CSP_DMA_STREAM(x, y)       _CSP_DMA_STREAM(x, y)

/* Pasting the DMA Stream IRQn and IRQHandler. */
#define _CSP_DMA_STREAM(x, y)      DMA##x##_Stream##y
#define CSP_DMA_STREAM(x, y)       _CSP_DMA_STREAM(x, y)

#define _CSP_DMA_STREAM_IRQn(x, y) DMA##x##_Stream##y##_IRQn
#define CSP_DMA_STREAM_IRQn(x, y)  _CSP_DMA_STREAM_IRQn(x, y)

#define _CSP_DMA_STREAM_IRQ(x, y)  DMA##x##_Stream##y##_IRQHandler
#define CSP_DMA_STREAM_IRQ(x, y)   _CSP_DMA_STREAM_IRQ(x, y)

/* Pasting the DMA Channel */
#define _CSP_DMA_CHANNEL(x)        DMA_CHANNEL_##x
#define CSP_DMA_CHANNEL(x)         _CSP_DMA_CHANNEL(x)

/* Set DMA Priority */
#define CSP_DMA_PRIORITY(x)        ((x) << DMA_SxCR_PL_Pos)

/* Enable and disable the clock of DMA. */
#define _CSP_DMA_CLK_ENABLE(x)     __HAL_RCC_DMA##x##_CLK_ENABLE()
#define CSP_DMA_CLK_ENABLE(x)      _CSP_DMA_CLK_ENABLE(x)

/* CSP memory management functions. */
#define CSP_MALLOC                 malloc
#define CSP_FREE                   free
#define CSP_REALLOC                realloc
#include <stdlib.h>

/* Devices Family header files.  */
#include "stm32f4xx_hal.h"

#if (USART1_ENABLE || USART2_ENABLE || USART3_ENABLE || UART4_ENABLE ||        \
     UART5_ENABLE || USART6_ENABLE || UART7_ENABLE || UART8_ENABLE ||          \
     UART9_ENABLE || UART10_ENABLE)
#include "../UART_STM32F4xx.h"
#endif /* (USART1_ENABLE || USART2_ENABLE || USART3_ENABLE || UART4_ENABLE ||  \
           UART5_ENABLE || USART6_ENABLE || UART7_ENABLE || UART8_ENABLE ||    \
           UART9_ENABLE || UART10_ENABLE) */

#if (I2C1_ENABLE || I2C2_ENABLE || I2C3_ENABLE)
#include "../I2C_STM32F4xx.h"
#endif /* (I2C1_ENABLE || I2C2_ENABLE || I2C3_ENABLE) */

#if (SPI1_ENABLE || SPI2_ENABLE || SPI3_ENABLE || SPI4_ENABLE ||               \
     SPI5_ENABLE || SPI6_ENABLE)
#include "../SPI_STM32F4xx.h"
#endif /* (SPI1_ENABLE || SPI2_ENABLE || SPI3_ENABLE || SPI4_ENABLE ||         \
           SPI5_ENABLE || SPI6_ENABLE) */

#if (CAN1_ENABLE || CAN2_ENABLE || CAN3_ENABLE)
#include "../CAN_STM32F4xx.h"
#endif /* (CAN1_ENABLE || CAN2_ENABLE || CAN3_ENABLE) */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* __CSP_CONFIG_H */
